{
    "My Profile": "Profilul Meu",
    "Sign Out": "Deconectare",
    "Profile Information": "Informații Profil",
    "Update your account's profile information and email address.": "Actualizează informațiile profilului și adresa de email.",
    "Avatar": "Avatar",
    "Allowed file types: png, jpg, jpeg. Max 2MB.": "Tipuri de fișiere permise: png, jpg, jpeg. Maxim 2MB.",
    "Remove current avatar": "Elimină avatarul curent",
    "Name": "Nume",
    "Email": "Email",
    "Your email address is unverified.": "Adresa ta de email nu este verificată.",
    "A new verification link has been sent to your email address.": "Un nou link de verificare a fost trimis la adresa ta de email.",
    "Save Changes": "Salvează Modificările",
    "Email Verification": "Verificare Email",
    "Your email address is unverified. Please verify your email to access all features.": "Adresa ta de email nu este verificată. Te rugăm să verifici emailul pentru a accesa toate funcționalitățile.",
    "Resend Verification Email": "Retrimite Email de Verificare",
    "Update Password": "Actualizează Parola",
    "Ensure your account is using a long, random password to stay secure.": "Asigură-te că contul tău folosește o parolă lungă și aleatorie pentru a rămâne în siguranță.",
    "Current Password": "Parola Curentă",
    "New Password": "Parolă Nouă",
    "Confirm Password": "Confirmă Parola",
    "Delete Account": "Șterge Contul",
    "Once your account is deleted, all of its resources and data will be permanently deleted. Before deleting your account, please download any data or information that you wish to retain.": "Odată ce contul tău este șters, toate resursele și datele acestuia vor fi șterse permanent. Înainte de a șterge contul, te rugăm să descarci toate datele sau informațiile pe care dorești să le păstrezi.",
    "Are you sure you want to delete your account? Once your account is deleted, all of its resources and data will be permanently deleted. Please enter your password to confirm you would like to permanently delete your account.": "Ești sigur că vrei să ștergi contul? Odată ce contul este șters, toate resursele și datele acestuia vor fi șterse permanent. Te rugăm să introduci parola pentru a confirma că dorești să ștergi permanent contul.",
    "Password": "Parolă",
    "Enter your password": "Introdu parola",
    "Cancel": "Anulează",
    "Profile updated successfully!": "Profil actualizat cu succes!",
    "Password updated successfully!": "Parolă actualizată cu succes!",
    "You do not have permission to access this resource.": "Nu ai permisiunea de a accesa această resursă.",
    "You do not have the required permission or role to access this resource.": "Nu ai permisiunea sau rolul necesar pentru a accesa această resursă.",
    "Home": "Acasă",
    "About": "Despre Noi",
    "Services": "Servicii",
    "Contact": "Contact",
    "Dashboard": "Panou de Control",
    "Log in": "Autentificare",
    "Building innovative solutions for modern businesses. Your trusted partner in digital transformation.": "Construim soluții inovatoare pentru afaceri moderne. Partenerul tău de încredere în transformarea digitală.",
    "Quick Links": "Link-uri Rapide",
    "All rights reserved.": "Toate drepturile rezervate.",
    "Welcome to": "Bine ați venit la",
    "Transform your business with our innovative solutions. We provide cutting-edge technology and exceptional service to help you succeed.": "Transformă-ți afacerea cu soluțiile noastre inovatoare. Oferim tehnologie de ultimă generație și servicii excepționale pentru a te ajuta să reușești.",
    "Get Started": "Începe Acum",
    "Learn More": "Află Mai Mult",
    "Why Choose Us": "De Ce Să Ne Alegi",
    "We deliver excellence through our core values and expertise": "Oferim excelență prin valorile și expertiza noastră",
    "Fast & Reliable": "Rapid și Fiabil",
    "Lightning-fast performance with 99.9% uptime guarantee. Your business never sleeps, and neither do we.": "Performanță ultrarapidă cu garanție de 99.9% disponibilitate. Afacerea ta nu doarme niciodată, și nici noi.",
    "Secure & Private": "Sigur și Privat",
    "Enterprise-grade security with end-to-end encryption. Your data is protected with military-grade encryption.": "Securitate de nivel enterprise cu criptare end-to-end. Datele tale sunt protejate cu criptare de nivel militar.",
    "Fully Customizable": "Complet Personalizabil",
    "Tailor every aspect to your needs. Our flexible platform adapts to your unique business requirements.": "Personalizează fiecare aspect după nevoile tale. Platforma noastră flexibilă se adaptează cerințelor unice ale afacerii tale.",
    "24/7 Support": "Suport 24/7",
    "Round-the-clock customer support from our expert team. We are here whenever you need us.": "Suport clienți non-stop de la echipa noastră de experți. Suntem aici oricând ai nevoie de noi.",
    "Analytics Dashboard": "Panou de Analiză",
    "Powerful insights with real-time analytics. Make data-driven decisions with our comprehensive dashboard.": "Informații puternice cu analiză în timp real. Ia decizii bazate pe date cu panoul nostru complet.",
    "Team Collaboration": "Colaborare în Echipă",
    "Work together seamlessly with powerful collaboration tools. Keep your team aligned and productive.": "Lucrați împreună fără probleme cu instrumente puternice de colaborare. Mențineți echipa aliniată și productivă.",
    "Ready to get started?": "Gata să începi?",
    "Join thousands of satisfied customers who trust us with their business.": "Alătură-te miilor de clienți mulțumiți care ne încredințează afacerea lor.",
    "Contact Us": "Contactează-ne",
    "View Services": "Vezi Serviciile",
    "About Us": "Despre Noi",
    "Learn more about our mission, vision, and the team behind our success.": "Află mai multe despre misiunea, viziunea și echipa din spatele succesului nostru.",
    "Our Story": "Povestea Noastră",
    "Founded in 2024, we have been at the forefront of digital innovation, helping businesses transform and thrive in the digital age.": "Fondate în 2024, am fost în fruntea inovației digitale, ajutând afacerile să se transforme și să prospere în era digitală.",
    "Our journey began with a simple mission: to provide cutting-edge technology solutions that empower businesses to reach their full potential.": "Călătoria noastră a început cu o misiune simplă: să oferim soluții tehnologice de ultimă generație care împuternicesc afacerile să își atingă întregul potențial.",
    "Today, we serve thousands of clients worldwide, delivering exceptional results and building lasting partnerships.": "Astăzi, servim mii de clienți din întreaga lume, oferind rezultate excepționale și construind parteneriate durabile.",
    "Clients": "Clienți",
    "Team Members": "Membri în Echipă",
    "Satisfaction": "Satisfacție",
    "Our Mission": "Misiunea Noastră",
    "To empower businesses with innovative technology solutions that drive growth, efficiency, and success in the digital era.": "Să împuternicim afacerile cu soluții tehnologice inovatoare care stimulează creșterea, eficiența și succesul în era digitală.",
    "Our Vision": "Viziunea Noastră",
    "To be the leading technology partner for businesses worldwide, recognized for excellence, innovation, and exceptional customer service.": "Să fim partenerul tehnologic de frunte pentru afacerile din întreaga lume, recunoscuți pentru excelență, inovație și servicii excepționale pentru clienți.",
    "Our Values": "Valorile Noastre",
    "The principles that guide everything we do": "Principiile care ghidează tot ceea ce facem",
    "Excellence": "Excelență",
    "We strive for excellence in everything we do": "Ne străduim pentru excelență în tot ceea ce facem",
    "Innovation": "Inovație",
    "Constantly pushing boundaries and exploring new ideas": "Împingem constant limitele și explorăm idei noi",
    "Integrity": "Integritate",
    "Building trust through transparency and honesty": "Construim încredere prin transparență și onestitate",
    "Quality": "Calitate",
    "Delivering superior quality in every project": "Oferim calitate superioară în fiecare proiect",
    "Our Services": "Serviciile Noastre",
    "Comprehensive solutions tailored to your business needs": "Soluții complete adaptate nevoilor afacerii tale",
    "Web Development": "Dezvoltare Web",
    "Custom web applications built with modern technologies. From simple websites to complex enterprise solutions.": "Aplicații web personalizate construite cu tehnologii moderne. De la site-uri simple la soluții enterprise complexe.",
    "Responsive Design": "Design Responsiv",
    "Modern Frameworks": "Framework-uri Moderne",
    "SEO Optimized": "Optimizat SEO",
    "Mobile Development": "Dezvoltare Mobile",
    "Native and cross-platform mobile apps for iOS and Android. Beautiful, fast, and user-friendly applications.": "Aplicații mobile native și cross-platform pentru iOS și Android. Aplicații frumoase, rapide și ușor de utilizat.",
    "iOS & Android": "iOS și Android",
    "Cross-Platform": "Cross-Platform",
    "App Store Deployment": "Implementare în App Store",
    "Cloud Solutions": "Soluții Cloud",
    "Scalable cloud infrastructure and migration services. Maximize performance while minimizing costs.": "Infrastructură cloud scalabilă și servicii de migrare. Maximizează performanța minimizând costurile.",
    "Cloud Migration": "Migrare Cloud",
    "Infrastructure Setup": "Configurare Infrastructură",
    "24/7 Monitoring": "Monitorizare 24/7",
    "Consulting": "Consultanță",
    "Expert guidance to help you make the right technology decisions. Strategic planning and implementation support.": "Îndrumare expertă pentru a te ajuta să iei deciziile tehnologice corecte. Planificare strategică și suport pentru implementare.",
    "Technology Strategy": "Strategie Tehnologică",
    "Digital Transformation": "Transformare Digitală",
    "Process Optimization": "Optimizare Procese",
    "Data Analytics": "Analiză Date",
    "Transform your data into actionable insights. Advanced analytics and business intelligence solutions.": "Transformă datele în informații acționabile. Soluții avansate de analiză și business intelligence.",
    "Data Visualization": "Vizualizare Date",
    "Predictive Analytics": "Analiză Predictivă",
    "Custom Dashboards": "Panouri Personalizate",
    "Security Services": "Servicii de Securitate",
    "Protect your business with enterprise-grade security solutions. Comprehensive security audits and implementation.": "Protejează-ți afacerea cu soluții de securitate de nivel enterprise. Audituri de securitate complete și implementare.",
    "Security Audits": "Audituri de Securitate",
    "Penetration Testing": "Testare de Penetrare",
    "Compliance Management": "Management Conformitate",
    "Need a Custom Solution?": "Ai nevoie de o Soluție Personalizată?",
    "We can tailor our services to meet your specific requirements. Get in touch with us to discuss your project.": "Putem adapta serviciile noastre pentru a îndeplini cerințele tale specifice. Contactează-ne pentru a discuta proiectul tău.",
    "Get in touch with our team. We are here to help you succeed.": "Intră în contact cu echipa noastră. Suntem aici pentru a te ajuta să reușești.",
    "Get in Touch": "Contactează-ne",
    "Have a question or want to work together? Fill out the form and we will get back to you as soon as possible.": "Ai o întrebare sau vrei să colaborăm? Completează formularul și te vom contacta cât mai curând posibil.",
    "Phone": "Telefon",
    "Office": "Birou",
    "Business Hours": "Program",
    "Monday - Friday": "Luni - Vineri",
    "Follow Us": "Urmărește-ne",
    "First Name": "Prenume",
    "Last Name": "Nume",
    "Optional": "Opțional",
    "Subject": "Subiect",
    "Message": "Mesaj",
    "Send Message": "Trimite Mesaj",
    "Trusted by Leading Companies": "De Încredere pentru Companii de Frunte",
    "We are proud to work with these amazing clients": "Suntem mândri să colaborăm cu acești clienți extraordinari",
    "AI-Powered Development": "Dezvoltare Asistată de AI",
    "Leveraging cutting-edge artificial intelligence to accelerate development, optimize code quality, and deliver smarter solutions that evolve with your business needs.": "Folosim inteligența artificială de ultimă generație pentru a accelera dezvoltarea, optimiza calitatea codului și livra soluții inteligente care evoluează odată cu nevoile afacerii tale.",
    "Transform Your Excel Spreadsheets Into Powerful Cloud Solutions": "Transformă Fișierele Excel în Soluții Cloud Puternice",
    "Stop managing your business with outdated spreadsheets. We transform your Excel files into modern, scalable cloud applications with real-time collaboration, automated workflows, and intelligent insights.": "Oprește gestionarea afacerii cu foi de calcul depășite. Transformăm fișierele tale Excel în aplicații cloud moderne, scalabile, cu colaborare în timp real, fluxuri de lucru automatizate și informații inteligente.",
    "Real-Time Collaboration": "Colaborare în Timp Real",
    "Multiple users, instant updates, no version conflicts": "Utilizatori multipli, actualizări instantanee, fără conflicte de versiuni",
    "Automated Workflows": "Fluxuri de Lucru Automatizate",
    "Eliminate manual tasks and reduce human errors": "Elimină sarcinile manuale și reduce erorile umane",
    "Advanced Security": "Securitate Avansată",
    "Role-based access, audit logs, and encrypted data": "Acces bazat pe roluri, jurnale de audit și date criptate",
    "Smart Analytics": "Analiză Inteligentă",
    "AI-powered insights and predictive analytics": "Informații bazate pe AI și analiză predictivă",
    "Transform Your Excel Today": "Transformă-ți Excel-ul Astăzi",
    "Cloud Solution": "Soluție Cloud",
    "Faster": "Mai Rapid",
    "Uptime": "Disponibilitate",
    "Secure": "Securizat"
}
