{
    "My Profile": "Profilul Meu",
    "Sign Out": "Deconectare",
    "Profile Information": "Informații Profil",
    "Update your account's profile information and email address.": "Actualizează informațiile profilului și adresa de email.",
    "Avatar": "Avatar",
    "Allowed file types: png, jpg, jpeg. Max 2MB.": "Tipuri de fișiere permise: png, jpg, jpeg. Maxim 2MB.",
    "Remove current avatar": "Elimină avatarul curent",
    "Name": "Nume",
    "Email": "Email",
    "Your email address is unverified.": "Adresa ta de email nu este verificată.",
    "A new verification link has been sent to your email address.": "Un nou link de verificare a fost trimis la adresa ta de email.",
    "Save Changes": "Salvează Modificările",
    "Email Verification": "Verificare Email",
    "Your email address is unverified. Please verify your email to access all features.": "Adresa ta de email nu este verificată. Te rugăm să verifici emailul pentru a accesa toate funcționalitățile.",
    "Resend Verification Email": "Retrimite Email de Verificare",
    "Update Password": "Actualizează Parola",
    "Ensure your account is using a long, random password to stay secure.": "Asigură-te că contul tău folosește o parolă lungă și aleatorie pentru a rămâne în siguranță.",
    "Current Password": "Parola Curentă",
    "New Password": "Parolă Nouă",
    "Confirm Password": "Confirmă Parola",
    "Delete Account": "Șterge Contul",
    "Once your account is deleted, all of its resources and data will be permanently deleted. Before deleting your account, please download any data or information that you wish to retain.": "Odată ce contul tău este șters, toate resursele și datele acestuia vor fi șterse permanent. Înainte de a șterge contul, te rugăm să descarci toate datele sau informațiile pe care dorești să le păstrezi.",
    "Are you sure you want to delete your account? Once your account is deleted, all of its resources and data will be permanently deleted. Please enter your password to confirm you would like to permanently delete your account.": "Ești sigur că vrei să ștergi contul? Odată ce contul este șters, toate resursele și datele acestuia vor fi șterse permanent. Te rugăm să introduci parola pentru a confirma că dorești să ștergi permanent contul.",
    "Password": "Parolă",
    "Enter your password": "Introdu parola",
    "Cancel": "Anulează",
    "Profile updated successfully!": "Profil actualizat cu succes!",
    "Password updated successfully!": "Parolă actualizată cu succes!",
    "You do not have permission to access this resource.": "Nu ai permisiunea de a accesa această resursă.",
    "You do not have the required permission or role to access this resource.": "Nu ai permisiunea sau rolul necesar pentru a accesa această resursă.",
    "Home": "Acasă",
    "About": "Despre Noi",
    "Services": "Servicii",
    "Contact": "Contact",
    "Dashboard": "Panou de Control",
    "Log in": "Autentificare",
    "Building innovative solutions for modern businesses. Your trusted partner in digital transformation.": "Construim soluții inovatoare pentru afaceri moderne. Partenerul tău de încredere în transformarea digitală.",
    "Quick Links": "Link-uri Rapide",
    "All rights reserved.": "Toate drepturile rezervate.",
    "Welcome to": "Bine ați venit la",
    "Transform your business with our innovative solutions. We provide cutting-edge technology and exceptional service to help you succeed.": "Transformă-ți afacerea cu soluțiile noastre inovatoare. Oferim tehnologie de ultimă generație și servicii excepționale pentru a te ajuta să reușești.",
    "Get Started": "Începe Acum",
    "Learn More": "Află Mai Mult",
    "Why Choose Us": "De Ce Să Ne Alegi",
    "We deliver excellence through our core values and expertise": "Oferim excelență prin valorile și expertiza noastră",
    "Fast & Reliable": "Rapid și Fiabil",
    "Lightning-fast performance with 99.9% uptime guarantee. Your business never sleeps, and neither do we.": "Performanță ultrarapidă cu garanție de 99.9% disponibilitate. Afacerea ta nu doarme niciodată, și nici noi.",
    "Secure & Private": "Sigur și Privat",
    "Enterprise-grade security with end-to-end encryption. Your data is protected with military-grade encryption.": "Securitate de nivel enterprise cu criptare end-to-end. Datele tale sunt protejate cu criptare de nivel militar.",
    "Fully Customizable": "Complet Personalizabil",
    "Tailor every aspect to your needs. Our flexible platform adapts to your unique business requirements.": "Personalizează fiecare aspect după nevoile tale. Platforma noastră flexibilă se adaptează cerințelor unice ale afacerii tale.",
    "24/7 Support": "Suport 24/7",
    "Round-the-clock customer support from our expert team. We are here whenever you need us.": "Suport clienți non-stop de la echipa noastră de experți. Suntem aici oricând ai nevoie de noi.",
    "Analytics Dashboard": "Panou de Analiză",
    "Powerful insights with real-time analytics. Make data-driven decisions with our comprehensive dashboard.": "Informații puternice cu analiză în timp real. Ia decizii bazate pe date cu panoul nostru complet.",
    "Team Collaboration": "Colaborare în Echipă",
    "Work together seamlessly with powerful collaboration tools. Keep your team aligned and productive.": "Lucrați împreună fără probleme cu instrumente puternice de colaborare. Mențineți echipa aliniată și productivă.",
    "Ready to get started?": "Gata să începi?",
    "Join thousands of satisfied customers who trust us with their business.": "Alătură-te miilor de clienți mulțumiți care ne încredințează afacerea lor.",
    "Contact Us": "Contactează-ne",
    "View Services": "Vezi Serviciile",
    "About Us": "Despre Noi",
    "Learn more about our mission, vision, and the team behind our success.": "Află mai multe despre misiunea, viziunea și echipa din spatele succesului nostru.",
    "Our Story": "Povestea Noastră",
    "Founded in 2024, we have been at the forefront of digital innovation, helping businesses transform and thrive in the digital age.": "Fondate în 2024, am fost în fruntea inovației digitale, ajutând afacerile să se transforme și să prospere în era digitală.",
    "Our journey began with a simple mission: to provide cutting-edge technology solutions that empower businesses to reach their full potential.": "Călătoria noastră a început cu o misiune simplă: să oferim soluții tehnologice de ultimă generație care împuternicesc afacerile să își atingă întregul potențial.",
    "Today, we serve thousands of clients worldwide, delivering exceptional results and building lasting partnerships.": "Astăzi, servim mii de clienți din întreaga lume, oferind rezultate excepționale și construind parteneriate durabile.",
    "Clients": "Clienți",
    "Team Members": "Membri în Echipă",
    "Satisfaction": "Satisfacție",
    "Our Mission": "Misiunea Noastră",
    "To empower businesses with innovative technology solutions that drive growth, efficiency, and success in the digital era.": "Să împuternicim afacerile cu soluții tehnologice inovatoare care stimulează creșterea, eficiența și succesul în era digitală.",
    "Our Vision": "Viziunea Noastră",
    "To be the leading technology partner for businesses worldwide, recognized for excellence, innovation, and exceptional customer service.": "Să fim partenerul tehnologic de frunte pentru afacerile din întreaga lume, recunoscuți pentru excelență, inovație și servicii excepționale pentru clienți.",
    "Our Values": "Valorile Noastre",
    "The principles that guide everything we do": "Principiile care ghidează tot ceea ce facem",
    "Excellence": "Excelență",
    "We strive for excellence in everything we do": "Ne străduim pentru excelență în tot ceea ce facem",
    "Innovation": "Inovație",
    "Constantly pushing boundaries and exploring new ideas": "Împingem constant limitele și explorăm idei noi",
    "Integrity": "Integritate",
    "Building trust through transparency and honesty": "Construim încredere prin transparență și onestitate",
    "Quality": "Calitate",
    "Delivering superior quality in every project": "Oferim calitate superioară în fiecare proiect",
    "Our Services": "Serviciile Noastre",
    "Comprehensive solutions tailored to your business needs": "Soluții complete adaptate nevoilor afacerii tale",
    "Web Development": "Dezvoltare Web",
    "Custom web applications built with modern technologies. From simple websites to complex enterprise solutions.": "Aplicații web personalizate construite cu tehnologii moderne. De la site-uri simple la soluții enterprise complexe.",
    "Responsive Design": "Design Responsiv",
    "Modern Frameworks": "Framework-uri Moderne",
    "SEO Optimized": "Optimizat SEO",
    "Mobile Development": "Dezvoltare Mobile",
    "Native and cross-platform mobile apps for iOS and Android. Beautiful, fast, and user-friendly applications.": "Aplicații mobile native și cross-platform pentru iOS și Android. Aplicații frumoase, rapide și ușor de utilizat.",
    "iOS & Android": "iOS și Android",
    "Cross-Platform": "Cross-Platform",
    "App Store Deployment": "Implementare în App Store",
    "Cloud Solutions": "Soluții Cloud",
    "Scalable cloud infrastructure and migration services. Maximize performance while minimizing costs.": "Infrastructură cloud scalabilă și servicii de migrare. Maximizează performanța minimizând costurile.",
    "Cloud Migration": "Migrare Cloud",
    "Infrastructure Setup": "Configurare Infrastructură",
    "24/7 Monitoring": "Monitorizare 24/7",
    "Consulting": "Consultanță",
    "Expert guidance to help you make the right technology decisions. Strategic planning and implementation support.": "Îndrumare expertă pentru a te ajuta să iei deciziile tehnologice corecte. Planificare strategică și suport pentru implementare.",
    "Technology Strategy": "Strategie Tehnologică",
    "Digital Transformation": "Transformare Digitală",
    "Process Optimization": "Optimizare Procese",
    "Data Analytics": "Analiză Date",
    "Transform your data into actionable insights. Advanced analytics and business intelligence solutions.": "Transformă datele în informații acționabile. Soluții avansate de analiză și business intelligence.",
    "Data Visualization": "Vizualizare Date",
    "Predictive Analytics": "Analiză Predictivă",
    "Custom Dashboards": "Panouri Personalizate",
    "Security Services": "Servicii de Securitate",
    "Protect your business with enterprise-grade security solutions. Comprehensive security audits and implementation.": "Protejează-ți afacerea cu soluții de securitate de nivel enterprise. Audituri de securitate complete și implementare.",
    "Security Audits": "Audituri de Securitate",
    "Penetration Testing": "Testare de Penetrare",
    "Compliance Management": "Management Conformitate",
    "Need a Custom Solution?": "Ai nevoie de o Soluție Personalizată?",
    "We can tailor our services to meet your specific requirements. Get in touch with us to discuss your project.": "Putem adapta serviciile noastre pentru a îndeplini cerințele tale specifice. Contactează-ne pentru a discuta proiectul tău.",
    "Get in touch with our team. We are here to help you succeed.": "Intră în contact cu echipa noastră. Suntem aici pentru a te ajuta să reușești.",
    "Get in Touch": "Contactează-ne",
    "Have a question or want to work together? Fill out the form and we will get back to you as soon as possible.": "Ai o întrebare sau vrei să colaborăm? Completează formularul și te vom contacta cât mai curând posibil.",
    "Phone": "Telefon",
    "Office": "Birou",
    "Business Hours": "Program",
    "Monday - Friday": "Luni - Vineri",
    "Follow Us": "Urmărește-ne",
    "First Name": "Prenume",
    "Last Name": "Nume",
    "Optional": "Opțional",
    "Subject": "Subiect",
    "Message": "Mesaj",
    "Send Message": "Trimite Mesaj",
    "Trusted by Leading Companies": "De Încredere pentru Companii de Frunte",
    "We are proud to work with these amazing clients": "Suntem mândri să colaborăm cu acești clienți extraordinari",
    "AI-Powered Development": "Dezvoltare Asistată de AI",
    "Leveraging cutting-edge artificial intelligence to accelerate development, optimize code quality, and deliver smarter solutions that evolve with your business needs.": "Folosim inteligența artificială de ultimă generație pentru a accelera dezvoltarea, optimiza calitatea codului și livra soluții inteligente care evoluează odată cu nevoile afacerii tale.",
    "Transform Your Excel Spreadsheets Into Powerful Cloud Solutions": "Transformă Fișierele Excel în Soluții Cloud Puternice",
    "Stop managing your business with outdated spreadsheets. We transform your Excel files into modern, scalable cloud applications with real-time collaboration, automated workflows, and intelligent insights.": "Oprește gestionarea afacerii cu foi de calcul depășite. Transformăm fișierele tale Excel în aplicații cloud moderne, scalabile, cu colaborare în timp real, fluxuri de lucru automatizate și informații inteligente.",
    "Real-Time Collaboration": "Colaborare în Timp Real",
    "Multiple users, instant updates, no version conflicts": "Utilizatori multipli, actualizări instantanee, fără conflicte de versiuni",
    "Automated Workflows": "Fluxuri de Lucru Automatizate",
    "Eliminate manual tasks and reduce human errors": "Elimină sarcinile manuale și reduce erorile umane",
    "Advanced Security": "Securitate Avansată",
    "Role-based access, audit logs, and encrypted data": "Acces bazat pe roluri, jurnale de audit și date criptate",
    "Smart Analytics": "Analiză Inteligentă",
    "AI-powered insights and predictive analytics": "Informații bazate pe AI și analiză predictivă",
    "Transform Your Excel Today": "Transformă-ți Excel-ul Astăzi",
    "Cloud Solution": "Soluție Cloud",
    "Faster": "Mai Rapid",
    "Uptime": "Disponibilitate",
    "Secure": "Securizat",
    "Thank you for your message! We will get back to you soon.": "Mulțumim pentru mesajul tău! Îți vom răspunde în curând.",
    "There was an error sending your message. Please try again later.": "A apărut o eroare la trimiterea mesajului. Te rugăm să încerci din nou mai târziu.",
    "Case Studies": "Studii de Caz",
    "Real projects, real results — see how we've helped companies build scalable payment systems, high-performance platforms, and mission-critical infrastructure": "Proiecte reale, rezultate reale — vezi cum am ajutat companii să construiască sisteme de plăți scalabile, platforme performante și infrastructură critică",
    "Case Study #1: Payments": "Studiu de Caz #1: Plăți",
    "Payment Infrastructure Migration": "Migrarea Infrastructurii de Plăți",
    "ChargeOver → Stripe Billing": "ChargeOver → Stripe Billing",
    "Client": "Client",
    "Financial Platform (USA)": "Platformă Financiară (SUA)",
    "Tech: Stripe Billing, ACH, PHP 8, Laravel, Redis, AWS": "Tehnologii: Stripe Billing, ACH, PHP 8, Laravel, Redis, AWS",
    "Challenge": "Provocare",
    "The company relied on an outdated billing system (ChargeOver), with recurring errors, rigid API capabilities, and low payment recovery rates. They needed a modern payment stack with ACH, subscriptions, proration, retries, and full automation — without downtime.": "Compania se baza pe un sistem de facturare depășit (ChargeOver), cu erori recurente, capabilități API rigide și rate scăzute de recuperare a plăților. Aveau nevoie de un stack modern de plăți cu ACH, abonamente, proration, reîncercări și automatizare completă — fără downtime.",
    "Solution": "Soluție",
    "We architected a complete Stripe migration:": "Am arhitecturat o migrare completă către Stripe:",
    "Modeled products, prices, and subscription lifecycles": "Am modelat produse, prețuri și cicluri de viață ale abonamentelor",
    "Built an adapter-based payment orchestration layer": "Am construit un strat de orchestrare a plăților bazat pe adaptoare",
    "Implemented ACH onboarding & micro-deposit verification": "Am implementat onboarding ACH și verificare prin micro-depozite",
    "Created resilient webhook handlers with retries + idempotency": "Am creat handlere webhook reziliente cu reîncercări + idempotență",
    "Designed payout routes for multi-party financial flows": "Am proiectat rute de plată pentru fluxuri financiare multi-părți",
    "Results": "Rezultate",
    "Downtime": "Downtime",
    "Failed Payments": "Plăți Eșuate",
    "Simplified Reporting": "Raportare Simplificată",
    "Streamlined accounting": "Contabilitate optimizată",
    "Scalable Architecture": "Arhitectură Scalabilă",
    "Ready for new revenue models": "Pregătită pentru noi modele de venit",
    "Zero Downtime": "Zero Downtime",
    "Seamless migration": "Migrare fără întreruperi",
    "Case Study #2: Platform": "Studiu de Caz #2: Platformă",
    "Real-Time Inventory Platform for Retail": "Platformă de Inventar în Timp Real pentru Retail",
    "2,000+ SKU Custom ERP/Cloud Sync": "2,000+ SKU ERP Personalizat/Sincronizare Cloud",
    "Retail / eCommerce": "Retail / eCommerce",
    "Tech: Laravel, Redis, MySQL, Cloud + Local Sync": "Tehnologii: Laravel, Redis, MySQL, Sincronizare Cloud + Local",
    "Retailers needed a system to manage >2000 SKUs across both cloud and local stores, with real-time sync and fail-safe operations.": "Retailerii aveau nevoie de un sistem pentru a gestiona >2000 SKU-uri atât în cloud cât și în magazine locale, cu sincronizare în timp real și operațiuni fail-safe.",
    "We delivered a high-performance inventory engine:": "Am livrat un motor de inventar de înaltă performanță:",
    "Modular architecture": "Arhitectură modulară",
    "Delta-based sync between cloud & POS": "Sincronizare bazată pe delta între cloud & POS",
    "Conflict resolution for concurrent updates": "Rezolvare conflicte pentru actualizări concurente",
    "Near-instant stock adjustments with Redis caching": "Ajustări de stoc aproape instantanee cu caching Redis",
    "Faster Updates": "Actualizări Mai Rapide",
    "Sync Conflicts": "Conflicte de Sincronizare",
    "SKUs Managed": "SKU-uri Gestionate",
    "Cloud Sync": "Sincronizare Cloud",
    "Active": "Activ",
    "Local POS": "POS Local",
    "Synced": "Sincronizat",
    "Multi-Store": "Multi-Magazine",
    "Enabled": "Activat",
    "Case Study #3: Architecture": "Studiu de Caz #3: Arhitectură",
    "Policy Management System for Insurance": "Sistem de Gestionare Polițe pentru Asigurări",
    "Microservices + Event Architecture": "Microservicii + Arhitectură Bazată pe Evenimente",
    "Insurance Platform": "Platformă de Asigurări",
    "Tech: PHP 8, Laravel, Redis, AWS, Microservices": "Tehnologii: PHP 8, Laravel, Redis, AWS, Microservicii",
    "Client needed a scalable, modular system to manage thousands of insurance policies: updates, renewals, events, customer-facing portal.": "Clientul avea nevoie de un sistem scalabil și modular pentru a gestiona mii de polițe de asigurare: actualizări, reînnoiri, evenimente, portal pentru clienți.",
    "We built:": "Am construit:",
    "Microservices architecture for policy management": "Arhitectură de microservicii pentru gestionarea polițelor",
    "Automated workflows for renewals & compliance": "Fluxuri de lucru automate pentru reînnoiri și conformitate",
    "Customer portal for policy updates": "Portal pentru clienți pentru actualizări polițe",
    "Secure document processing + auditing": "Procesare securizată documente + audit",
    "Manual Operations": "Operațiuni Manuale",
    "Visibility": "Vizibilitate",
    "System Architecture": "Arhitectura Sistemului",
    "Microservices": "Microservicii",
    "Modular, scalable architecture": "Arhitectură modulară, scalabilă",
    "Event-Driven": "Bazat pe Evenimente",
    "Real-time policy updates": "Actualizări polițe în timp real",
    "Secure & Audited": "Securizat & Auditat",
    "Full compliance tracking": "Urmărire completă conformitate",
    "Case Study #4: Performance": "Studiu de Caz #4: Performanță",
    "Backend Platform Rewrite & High-Volume Content Processing": "Rescriere Platformă Backend & Procesare Conținut de Mare Volum",
    "High-Performance Parsing, Asynchronous Workflows": "Parsare de Înaltă Performanță, Fluxuri Asincrone",
    "Content Syndication / eCommerce Integrations": "Sindicalizare Conținut / Integrări eCommerce",
    "Tech: PHP, REST APIs, Job Queues, Asynchronous Workers": "Tehnologii: PHP, REST APIs, Cozi de Task-uri, Lucrători Asincron",
    "The platform processed large product data feeds for global retail integrations, but suffered from slow ingestion, blocking operations, and bugs that intermittently disrupted SLAs.": "Platforma procesa feed-uri mari de date de produse pentru integrări retail globale, dar suferea de ingestie lentă, operațiuni blocante și bug-uri care întrerupeau intermitent SLA-urile.",
    "I rebuilt and optimized critical backend systems:": "Am reconstruit și optimizat sisteme backend critice:",
    "Refactored the feed ingestion engine": "Am refactorizat motorul de ingestie feed-uri",
    "Reduced memory usage and improved throughput": "Am redus utilizarea memoriei și am îmbunătățit throughput-ul",
    "Implemented asynchronous job queue architecture": "Am implementat arhitectură de coadă de task-uri asincrone",
    "Added robust retry + recovery logic": "Am adăugat logică robustă de reîncercare + recuperare",
    "Improved error handling and operational visibility": "Am îmbunătățit gestionarea erorilor și vizibilitatea operațională",
    "Delivered additional modules such as feedback and payment integrations": "Am livrat module adiționale precum feedback și integrări de plăți",
    "Faster Feed Ingestion": "Ingestie Feed Mai Rapidă",
    "Platform at Scale": "Platformă la Scară",
    "Stable": "Stabil",
    "Key Improvements": "Îmbunătățiri Cheie",
    "50%+ Faster Ingestion": "50%+ Ingestie Mai Rapidă",
    "Optimized feed processing": "Procesare feed optimizată",
    "Predictable Processing": "Procesare Previzibilă",
    "Async job queue architecture": "Arhitectură coadă task-uri async",
    "Improved SLAs": "SLA-uri Îmbunătățite",
    "Enhanced customer satisfaction": "Satisfacție clienți îmbunătățită",
    "Case Study #5: Architecture": "Studiu de Caz #5: Arhitectură",
    "Lending Platform Modernization & Architecture Upgrade": "Modernizare Platformă de Creditare & Upgrade Arhitectură",
    "Platform Migration, System Architecture, Engineering Processes": "Migrare Platformă, Arhitectură Sistem, Procese de Inginerie",
    "Financial Services": "Servicii Financiare",
    "Tech: .NET, PHP, Redis, CI/CD (Jenkins, Docker, Puppet)": "Tehnologii: .NET, PHP, Redis, CI/CD (Jenkins, Docker, Puppet)",
    "A national-scale lending platform operated a monolithic legacy system with weak development processes, difficult deployments, and a roadmap blocked by technical debt. The platform needed a migration plan to a modern architecture and a fully redefined engineering workflow.": "O platformă de creditare la scară națională opera cu un sistem legacy monolitic cu procese slabe de dezvoltare, deployment-uri dificile și un roadmap blocat de datoria tehnică. Platforma avea nevoie de un plan de migrare către o arhitectură modernă și un workflow de inginerie complet redefinit.",
    "I led the system redesign and platform modernization initiative:": "Am condus inițiativa de redesign sistem și modernizare platformă:",
    "Defined the full architecture for service decomposition": "Am definit arhitectura completă pentru descompunerea serviciilor",
    "Created domain boundaries and data flow diagrams": "Am creat limite de domeniu și diagrame de flux de date",
    "Built transitional services enabling gradual migration": "Am construit servicii tranziționale care permit migrarea graduală",
    "Introduced CI/CD pipelines and standardized release processes": "Am introdus pipeline-uri CI/CD și procese standardizate de release",
    "Established documentation, coding practices, and cross-team workflows": "Am stabilit documentație, practici de programare și workflow-uri inter-echipe",
    "Integrated Redis for caching and performance improvements": "Am integrat Redis pentru caching și îmbunătățiri de performanță",
    "Modern": "Modernă",
    "Architecture": "Arhitectură",
    "Faster": "Mai Rapid",
    "Feature Delivery": "Livrare Funcționalități",
    "Transformation Outcomes": "Rezultate Transformare",
    "Clear Migration Path": "Cale de Migrare Clară",
    "Scalable modern architecture": "Arhitectură modernă scalabilă",
    "Strong Engineering Processes": "Procese Puternice de Inginerie",
    "Company-wide adoption": "Adopție la nivel de companie",
    "Reduced Deployment Failures": "Eșecuri Deployment Reduse",
    "Improved reliability": "Fiabilitate îmbunătățită",
    "Increased Delivery Speed": "Viteză de Livrare Crescută",
    "Better performance & maintainability": "Performanță & mentenabilitate mai bună",
    "Ready to Build Your Platform?": "Gata să Construiești Platforma Ta?",
    "Let's discuss how we can help you build scalable payment systems and high-performance platforms.": "Să discutăm cum te putem ajuta să construiești sisteme de plăți scalabile și platforme performante.",
    "Backend Engineering • Payments & Fintech • Distributed Systems • Cloud Architecture": "Inginerie Backend • Plăți & Fintech • Sisteme Distribuite • Arhitectură Cloud",
    "We Build Scalable Payment Systems": "Construim Sisteme de Plăți Scalabile",
    "& High-Performance Platforms": "& Platforme Performante",
    "designs and delivers mission-critical software for fintech, SaaS, and enterprise platforms. We specialize in Stripe integrations, subscription systems, payment orchestration, API platforms, and event-driven architectures that scale predictably and securely.": "proiectează și livrează software critic pentru platforme fintech, SaaS și enterprise. Ne specializăm în integrări Stripe, sisteme de abonamente, orchestrare plăți, platforme API și arhitecturi bazate pe evenimente care se scalează în mod previzibil și securizat.",
    "Let's Build Your Platform": "Să Construim Platforma Ta",
    "Why": "De Ce",
    "Deep technical expertise in payments, backend systems, and scalable cloud architecture": "Expertiză tehnică profundă în plăți, sisteme backend și arhitectură cloud scalabilă",
    "Deep Payments Expertise": "Expertiză Profundă în Plăți",
    "We architect subscription systems, ACH flows, multi-party payouts, and reliable webhook infrastructures for companies that cannot afford billing mistakes.": "Arhitectăm sisteme de abonamente, fluxuri ACH, plăți multi-părți și infrastructuri webhook fiabile pentru companii care nu își permit greșeli de facturare.",
    "High-Performance Backend": "Backend de Înaltă Performanță",
    "We design backend systems optimized for speed, resilience, and long-term maintainability using PHP 8, Laravel, Redis, MySQL/PostgreSQL, and modern distributed patterns.": "Proiectăm sisteme backend optimizate pentru viteză, reziliență și mentenabilitate pe termen lung folosind PHP 8, Laravel, Redis, MySQL/PostgreSQL și pattern-uri distribuite moderne.",
    "Event-Driven Architecture": "Arhitectură Bazată pe Evenimente",
    "We build event pipelines, queue-based workflows, microservices, and horizontally scalable systems using AWS, Redis, Docker, and modern tooling.": "Construim pipeline-uri de evenimente, workflow-uri bazate pe cozi, microservicii și sisteme scalabile orizontal folosind AWS, Redis, Docker și tooling modern.",
    "Security & Compliance": "Securitate & Conformitate",
    "From PCI-aligned data handling to secure onboarding and identity flows, we design software that meets serious industry standards.": "De la gestionarea datelor aliniate PCI la onboarding securizat și fluxuri de identitate, proiectăm software care îndeplinește standarde serioase ale industriei.",
    "What We Deliver": "Ce Livrăm",
    "Enterprise-grade systems built for scale, reliability, and long-term success": "Sisteme de nivel enterprise construite pentru scalabilitate, fiabilitate și succes pe termen lung",
    "Payment Orchestration Layers": "Straturi de Orchestrare Plăți",
    "Stripe Billing / Connect / ACH": "Stripe Billing / Connect / ACH",
    "Fintech-Grade Backend Systems": "Sisteme Backend de Nivel Fintech",
    "Scalable API Platforms": "Platforme API Scalabile",
    "Event-Driven Processing": "Procesare Bazată pe Evenimente",
    "Subscription & Invoicing Engines": "Motoare de Abonamente & Facturare",
    "Cloud Infrastructure & Tuning": "Infrastructură Cloud & Optimizare",
    "Legacy Payment Migrations": "Migrări de Sisteme de Plăți Legacy",
    "Distributed Queue Workflows": "Workflow-uri cu Cozi Distribuite",
    "View All Services": "Vezi Toate Serviciile",
    "Featured Work": "Lucrări Notabile",
    "Payments": "Plăți",
    "Migration from ChargeOver to Stripe Billing": "Migrare de la ChargeOver la Stripe Billing",
    "Financial Platform, USA": "Platformă Financiară, SUA",
    "Complete payment infrastructure migration with zero downtime. Implemented ACH onboarding, webhook orchestration, and resilient retry logic for a financial platform serving thousands of customers.": "Migrare completă a infrastructurii de plăți cu zero downtime. Am implementat onboarding ACH, orchestrare webhook și logică de reîncercare rezillientă pentru o platformă financiară care deservește mii de clienți.",
    "Platform": "Platformă",
    "Real-Time Inventory Platform for Retail": "Platformă de Inventar în Timp Real pentru Retail",
    "Custom ERP/Cloud Sync": "ERP Personalizat/Sincronizare Cloud",
    "Built a high-performance inventory engine managing 2,000+ SKUs with real-time cloud and local sync, delta-based updates, and conflict resolution for concurrent operations.": "Am construit un motor de inventar de înaltă performanță care gestionează 2,000+ SKU-uri cu sincronizare în timp real cloud și locală, actualizări bazate pe delta și rezolvare conflicte pentru operațiuni concurente.",
    "Policy Management System for Insurance": "Sistem de Gestionare Polițe pentru Asigurări",
    "Designed scalable microservices architecture for insurance platform with automated workflows, policy lifecycle management, and secure document processing with full audit trails.": "Am proiectat arhitectură de microservicii scalabilă pentru platformă de asigurări cu workflow-uri automate, gestionare ciclu de viață polițe și procesare securizată documente cu piste de audit complete.",
    "See All Case Studies": "Vezi Toate Studiile de Caz",
    "Expert engineering services for payment systems, backend platforms, and scalable cloud architecture": "Servicii de inginerie expert pentru sisteme de plăți, platforme backend și arhitectură cloud scalabilă",
    "Payments & Fintech Engineering": "Inginerie Plăți & Fintech",
    "We architect and implement complex financial workflows:": "Arhitectăm și implementăm workflow-uri financiare complexe:",
    "Stripe Billing, Direct & Connect": "Stripe Billing, Direct & Connect",
    "ACH debit/credit flows": "Fluxuri ACH debit/credit",
    "Subscription lifecycles": "Cicluri de viață abonamente",
    "Split payments / marketplaces": "Plăți împărțite / marketplace-uri",
    "Webhook orchestration (idempotency, retries)": "Orchestrare webhook (idempotență, reîncercări)",
    "PCI-aligned data handling": "Gestionare date aliniată PCI",
    "Migration from legacy billing providers": "Migrare de la furnizori legacy de facturare",
    "Ideal for: SaaS, fintech, marketplaces, financial apps": "Ideal pentru: SaaS, fintech, marketplace-uri, aplicații financiare",
    "Backend & Platform Engineering": "Inginerie Backend & Platformă",
    "We design scalable backend systems using modern engineering practices:": "Proiectăm sisteme backend scalabile folosind practici moderne de inginerie:",
    "PHP 8 / Laravel / Symfony": "PHP 8 / Laravel / Symfony",
    "Redis queues & event-driven workflows": "Cozi Redis & workflow-uri bazate pe evenimente",
    "Microservices & modular architecture": "Microservicii & arhitectură modulară",
    "Optimized SQL schema design": "Design schemă SQL optimizat",
    "High-performance APIs": "API-uri de înaltă performanță",
    "Large data processing & exports": "Procesare date la scară largă & exporturi",
    "Ideal for: platforms under heavy load or needing modernization": "Ideal pentru: platforme sub sarcină mare sau care necesită modernizare",
    "Cloud & Infrastructure": "Cloud & Infrastructură",
    "We build predictable, cost-effective environments:": "Construim medii previzibile și cost-eficiente:",
    "AWS ECS/EC2/RDS/S3": "AWS ECS/EC2/RDS/S3",
    "Dockerized pipelines": "Pipeline-uri Docker",
    "CI/CD automation": "Automatizare CI/CD",
    "Observability: Datadog, Sentry, CloudWatch": "Observabilitate: Datadog, Sentry, CloudWatch",
    "High-availability setups": "Configurări high-availability",
    "Infrastructure hardening": "Întărire infrastructură",
    "Ideal for: scaling platforms, reducing downtime, reliability": "Ideal pentru: scalarea platformelor, reducerea downtime-ului, fiabilitate",
    "Custom Software Development": "Dezvoltare Software Personalizat",
    "From concept to launch:": "De la concept la lansare:",
    "Custom admin dashboards": "Panouri admin personalizate",
    "Customer onboarding flows": "Fluxuri de onboarding clienți",
    "Multi-tenant applications": "Aplicații multi-tenant",
    "API integrations (banking, CRM, ERP)": "Integrări API (banking, CRM, ERP)",
    "Workflow automation": "Automatizare workflow",
    "Ideal for: long-term, maintainable systems": "Ideal pentru: sisteme pe termen lung, mentenabile",
    "A senior engineering-driven software studio focused on high-performance backend systems, fintech integrations, and scalable cloud architectures.": "Un studio software condus de ingineri seniori, focusat pe sisteme backend de înaltă performanță, integrări fintech și arhitecturi cloud scalabile.",
    "Founder & Senior Engineer": "Fondator & Inginer Senior",
    "15+ years experience in:": "15+ ani experiență în:",
    "Financial services": "Servicii financiare",
    "SaaS platforms": "Platforme SaaS",
    "Enterprise systems": "Sisteme enterprise",
    "We are a senior engineering-driven software studio focused on high-performance backend systems, fintech integrations, and scalable cloud architectures.": "Suntem un studio software condus de ingineri seniori, focusat pe sisteme backend de înaltă performanță, integrări fintech și arhitecturi cloud scalabile.",
    "Founded by Razvan, a Senior Backend/Platform Engineer with 15+ years of experience in financial services, SaaS platforms, and enterprise systems.": "Fondat de Razvan, un Inginer Senior Backend/Platformă cu 15+ ani de experiență în servicii financiare, platforme SaaS și sisteme enterprise.",
    "Our Philosophy": "Filozofia Noastră",
    "Build systems that don't break.": "Construim sisteme care nu se strică.",
    "Design architectures that scale.": "Proiectăm arhitecturi care se scalează.",
    "Deliver software that lasts.": "Livrăm software care durează.",
    "Expertise Highlights": "Puncte Forte de Expertiză",
    "Payment orchestration": "Orchestrare plăți",
    "Stripe, ACH, Connect": "Stripe, ACH, Connect",
    "Backend architecture": "Arhitectură backend",
    "Distributed systems": "Sisteme distribuite",
    "API platforms": "Platforme API",
    "Finance & insurance": "Finanțe & asigurări",
    "Cloud-native solutions": "Soluții cloud-native",
    "AWS": "AWS",
    "High-availability platforms": "Platforme high-availability",
    "Platform engineering": "Inginerie platformă",
    "Who We Work With": "Cu Cine Lucrăm",
    "SaaS Companies": "Companii SaaS",
    "Fintech & Insurtech": "Fintech & Insurtech",
    "Enterprise Platforms": "Platforme Enterprise",
    "Growth-Stage Startups": "Startup-uri în Creștere",
    "We partner with forward-thinking companies building the future": "Colaborăm cu companii vizionare care construiesc viitorul",
    "Subscription platforms needing billing infrastructure, payment orchestration, and scalable backend systems": "Platforme de abonamente care necesită infrastructură de facturare, orchestrare plăți și sisteme backend scalabile",
    "Financial services requiring PCI compliance, ACH flows, secure processing, and regulatory standards": "Servicii financiare care necesită conformitate PCI, fluxuri ACH, procesare securizată și standarde de reglementare",
    "Large-scale systems handling high volume, complex integrations, and mission-critical operations": "Sisteme la scară largă care gestionează volume mari, integrări complexe și operațiuni critice",
    "Fast-growing companies needing to scale infrastructure, modernize legacy code, and build for the next phase": "Companii în creștere rapidă care trebuie să scaleze infrastructura, să modernizeze codul legacy și să construiască pentru faza următoare",
    "Digital transformations": "Transformări digitale",
    "Legacy modernization": "Modernizare legacy",
    "Payments, Subscriptions & Platform Engineering": "Plăți, Abonamente & Inginerie Platformă",
    "for SaaS and Fintech": "pentru SaaS și Fintech",
    "We build scalable payment systems, subscription engines, and Stripe-based infrastructures. Mission-critical software engineered for reliability, compliance, and long-term growth.": "Construim sisteme de plăți scalabile, motoare de abonamente și infrastructuri bazate pe Stripe. Software critic proiectat pentru fiabilitate, conformitate și creștere pe termen lung.",
    "Start Your Project": "Începe Proiectul Tău",
    "Trusted for mission-critical systems in": "De încredere pentru sisteme critice în",
    "Fintech": "Fintech",
    "Insurance": "Asigurări",
    "SaaS": "SaaS",
    "E-Commerce": "E-Commerce",
    "What We Build": "Ce Construim",
    "Payment Systems": "Sisteme de Plăți",
    "Stripe Billing, ACH, Connect, payouts, reconciliation pipelines, webhook engines and end-to-end payment orchestration for regulated industries.": "Stripe Billing, ACH, Connect, plăți, pipeline-uri de reconciliere, motoare webhook și orchestrare de plăți end-to-end pentru industrii reglementate.",
    "Subscription Platforms": "Platforme de Abonamente",
    "Tiered pricing, metered billing, dunning strategies, customer dashboards, admin portals, and enterprise-grade subscription lifecycle automation.": "Prețuri pe niveluri, facturare măsurată, strategii de recuperare plăți, panouri clienți, portaluri admin și automatizare ciclu de viață abonamente de nivel enterprise.",
    "Backend & Cloud Engineering": "Inginerie Backend & Cloud",
    "Distributed systems, API architecture, microservices, Redis queues, AWS ECS/RDS/S3, high-performance processing and fault-tolerant platforms.": "Sisteme distribuite, arhitectură API, microservicii, cozi Redis, AWS ECS/RDS/S3, procesare de înaltă performanță și platforme reziliente.",
    "Stripe Migration & Payment Orchestration": "Migrare Stripe & Orchestrare Plăți",
    "Complete billing migration, ACH onboarding, webhook reliability patterns and reconciliation automation for a financial services platform.": "Migrare completă de facturare, onboarding ACH, pattern-uri de fiabilitate webhook și automatizare reconciliere pentru o platformă de servicii financiare.",
    "Read More": "Citește Mai Mult",
    "Inventory Platform for Multi-Store Retail": "Platformă de Inventar pentru Retail Multi-Magazine",
    "Real-time sync engine, conflict resolution algorithms and event-driven architecture enabling thousands of SKU updates instantly.": "Motor de sincronizare în timp real, algoritmi de rezolvare conflicte și arhitectură bazată pe evenimente care permite mii de actualizări SKU instant.",
    "Insurance Policy Management System": "Sistem de Gestionare Polițe de Asigurare",
    "Microservices, lifecycle automation, customer portals and secure policy workflows handling thousands of clients.": "Microservicii, automatizare ciclu de viață, portaluri clienți și workflow-uri securizate de polițe gestionând mii de clienți.",
    "Tech Expertise": "Expertiză Tehnică",
    "Modern technologies powering enterprise-grade solutions": "Tehnologii moderne care alimentează soluții de nivel enterprise",
    "Backend & Languages": "Backend & Limbaje",
    "Database & Caching": "Baze de Date & Caching",
    "Cloud & DevOps": "Cloud & DevOps",
    "Payment & Integration": "Plăți & Integrare",
    "Testing & Quality": "Testare & Calitate",
    "Let's Build Something That Scales": "Să Construim Ceva Care Se Scalează",
    "Privacy Policy": "Politica de Confidențialitate",
    "Last updated: December 2025": "Ultima actualizare: Decembrie 2025",
    "Effective date: December 2025": "Data efectivă: Decembrie 2025",
    "(\"we\", \"us\", \"our\") respects your privacy and is committed to protecting your personal data. This Privacy Policy explains how we collect, use, disclose, and safeguard your information when you visit our website": "(\"noi\", \"ne\") respectă confidențialitatea ta și ne angajăm să protejăm datele tale personale. Această Politică de Confidențialitate explică modul în care colectăm, folosim, dezvăluim și protejăm informațiile tale când vizitezi site-ul nostru web",
    "(the \"Site\") and when you interact with our Lead Gen Forms, contact forms, services, or email lists.": "(\"Site-ul\") și când interacționezi cu formularele noastre de generare lead-uri, formularele de contact, serviciile sau listele de email.",
    "By using the Site or submitting information to us, you consent to the collection and use of your data as described in this policy.": "Prin utilizarea Site-ului sau prin trimiterea de informații către noi, ești de acord cu colectarea și utilizarea datelor tale conform acestei politici.",
    "1. Information We Collect": "1. Informațiile Pe Care Le Colectăm",
    "1.1 Personal Data": "1.1 Date Personale",
    "We may collect personal information you voluntarily provide when you:": "Putem colecta informații personale pe care le furnizezi în mod voluntar când:",
    "fill out a contact or lead form": "completezi un formular de contact sau lead",
    "request a quote or consultation": "soliciti o ofertă sau consultanță",
    "sign up for newsletters or updates": "te abonezi la newslettere sau actualizări",
    "send us a message via email or messaging systems": "ne trimiți un mesaj prin email sau sisteme de mesagerie",
    "Personal data may include:": "Datele personale pot include:",
    "full name": "nume complet",
    "business email address": "adresa de email de afaceri",
    "company name": "nume companie",
    "job title": "titlu post",
    "any other information you choose to provide": "orice alte informații pe care alegi să le furnizezi",
    "1.2 Automatically Collected Information": "1.2 Informații Colectate Automat",
    "When you visit our Site, we may automatically collect:": "Când vizitezi Site-ul nostru, putem colecta automat:",
    "IP address": "adresa IP",
    "browser type and version": "tipul și versiunea browserului",
    "device type": "tipul dispozitivului",
    "pages viewed": "paginile vizualizate",
    "date/time stamps": "marcaje de dată/oră",
    "referral/exit pages": "pagini de referință/ieșire",
    "usage analytics": "analize de utilizare",
    "This information is collected through cookies and similar tracking technologies (see Section 6).": "Aceste informații sunt colectate prin cookie-uri și tehnologii similare de urmărire (vezi Secțiunea 6).",
    "2. How We Use Your Information": "2. Cum Folosim Informațiile Tale",
    "We use collected information to:": "Folosim informațiile colectate pentru a:",
    "respond to your inquiries and provide requested services": "răspunde la întrebările tale și furniza serviciile solicitate",
    "send administrative information (e.g., confirmations, updates)": "trimite informații administrative (de ex., confirmări, actualizări)",
    "deliver marketing and promotional communications (with consent)": "livra comunicări de marketing și promoționale (cu consimțământ)",
    "improve our Site and services": "îmbunătăți Site-ul și serviciile noastre",
    "monitor and analyze usage and trends": "monitoriza și analiza utilizarea și tendințele",
    "detect, prevent, or address technical issues": "detecta, preveni sau rezolva probleme tehnice",
    "We will not use your data for purposes not disclosed in this policy without your consent.": "Nu vom folosi datele tale pentru scopuri care nu sunt dezvăluite în această politică fără consimțământul tău.",
    "3. Legal Basis for Processing (GDPR)": "3. Baza Legală pentru Procesare (GDPR)",
    "If you are located in the European Economic Area (EEA), we process your data under the following legal bases:": "Dacă te afli în Spațiul Economic European (SEE), procesăm datele tale pe baza următoarelor temeiuri legale:",
    "Consent": "Consimțământ",
    "where you have given consent for a specific purpose": "unde ai dat consimțământ pentru un scop specific",
    "to perform services you've requested": "pentru a îndeplini serviciile pe care le-ai solicitat",
    "Legitimate interests": "Interese legitime",
    "to improve our services and maintain Site security": "pentru a îmbunătăți serviciile noastre și menține securitatea Site-ului",
    "You may withdraw consent at any time (see Section 9).": "Poți retrage consimțământul în orice moment (vezi Secțiunea 9).",
    "4. Sharing Your Information": "4. Partajarea Informațiilor Tale",
    "We may share your information with:": "Putem partaja informațiile tale cu:",
    "service providers who assist with Site operations, analytics, and marketing": "furnizori de servicii care ajută cu operațiunile Site-ului, analize și marketing",
    "legal authorities if required by law or legal process": "autorități legale dacă este cerut de lege sau proces legal",
    "third parties in connection with a business transition (e.g., merger, sale, acquisition)": "terțe părți în legătură cu o tranziție de afaceri (de ex., fuziune, vânzare, achiziție)",
    "We do not sell your personal information.": "Nu vindem informațiile tale personale.",
    "5. Third-Party Links and Services": "5. Link-uri și Servicii Terțe",
    "Our Site may contain links to third-party websites or services. We have no control over, and are not responsible for, the content, privacy practices, or policies of those third parties. We encourage you to review their privacy policies.": "Site-ul nostru poate conține link-uri către site-uri sau servicii terțe. Nu avem control asupra și nu suntem responsabili pentru conținutul, practicile de confidențialitate sau politicile acestor terțe părți. Te încurajăm să revizuiești politicile lor de confidențialitate.",
    "6. Cookies and Tracking Technologies": "6. Cookie-uri și Tehnologii de Urmărire",
    "We use cookies and similar tracking technologies to:": "Folosim cookie-uri și tehnologii similare de urmărire pentru a:",
    "track Site usage": "urmări utilizarea Site-ului",
    "store preferences": "stoca preferințe",
    "tailor your experience": "personaliza experiența ta",
    "You can manage your cookie preferences through your browser settings. Disabling cookies may affect Site functionality.": "Poți gestiona preferințele cookie-urilor prin setările browserului. Dezactivarea cookie-urilor poate afecta funcționalitatea Site-ului.",
    "7. Storage and Security": "7. Stocare și Securitate",
    "We implement reasonable technical and organizational safeguards to protect personal data against unauthorized access, alteration, or disclosure. However, no internet transmission or storage system can be guaranteed to be 100% secure.": "Implementăm măsuri tehnice și organizaționale rezonabile pentru a proteja datele personale împotriva accesului neautorizat, modificării sau dezvăluirii. Cu toate acestea, nicio transmisie sau sistem de stocare pe internet nu poate fi garantat 100% securizat.",
    "8. Data Retention": "8. Retenția Datelor",
    "We retain personal data only as long as necessary to fulfill the purposes listed in this policy unless a longer retention period is required by law. If you ask us to delete your data, we will take reasonable steps to do so (see Section 9).": "Păstrăm datele personale doar atât timp cât este necesar pentru a îndeplini scopurile enumerate în această politică, cu excepția cazului în care legea impune o perioadă mai lungă de păstrare. Dacă ne ceri să ștergem datele tale, vom lua măsuri rezonabile pentru a face acest lucru (vezi Secțiunea 9).",
    "9. Your Rights": "9. Drepturile Tale",
    "Depending on your location, you may have rights regarding your personal data, such as:": "În funcție de locația ta, poți avea drepturi privind datele tale personale, cum ar fi:",
    "right to access": "dreptul de acces",
    "right to correct": "dreptul de corectare",
    "right to delete": "dreptul de ștergere",
    "right to restrict processing": "dreptul de restricționare a procesării",
    "right to object to processing": "dreptul de opoziție la procesare",
    "right to data portability": "dreptul la portabilitatea datelor",
    "right to withdraw consent": "dreptul de retragere a consimțământului",
    "To exercise your rights, contact us at": "Pentru a-ți exercita drepturile, contactează-ne la",
    "10. Children's Privacy": "10. Confidențialitatea Copiilor",
    "Our Site is not intended for individuals under 16, and we do not knowingly collect personal data from children.": "Site-ul nostru nu este destinat persoanelor sub 16 ani și nu colectăm în mod conștient date personale de la copii.",
    "11. Changes to this Policy": "11. Modificări ale Acestei Politici",
    "We may update this Privacy Policy from time to time. The revised version will be posted on this page with an updated \"Last updated\" date. We encourage you to review this policy periodically.": "Putem actualiza această Politică de Confidențialitate periodic. Versiunea revizuită va fi postată pe această pagină cu o dată actualizată \"Ultima actualizare\". Te încurajăm să revizuiești această politică periodic.",
    "12. Contact Us": "12. Contactează-ne",
    "If you have questions or concerns about this Privacy Policy, please contact:": "Dacă ai întrebări sau preocupări despre această Politică de Confidențialitate, te rugăm să contactezi:",
    "Legal": "Legal",
    "Cookie Policy": "Politica Cookie-urilor",
    "This Cookie Policy explains how": "Această Politică Cookie explică cum",
    "(\"we\", \"us\", or \"our\") uses cookies and similar tracking technologies when you visit our website": "(\"noi\", \"ne\") folosește cookie-uri și tehnologii similare de urmărire când vizitezi site-ul nostru web",
    ". This policy should be read together with our": ". Această politică ar trebui citită împreună cu",
    "1. What Are Cookies?": "1. Ce Sunt Cookie-urile?",
    "Cookies are small text files that are placed on your device (computer, smartphone, or tablet) when you visit a website. They are widely used to make websites work more efficiently and provide information to website owners.": "Cookie-urile sunt fișiere text mici care sunt plasate pe dispozitivul tău (computer, smartphone sau tabletă) când vizitezi un site web. Sunt utilizate pe scară largă pentru a face site-urile web să funcționeze mai eficient și pentru a oferi informații proprietarilor de site-uri web.",
    "2. How We Use Cookies": "2. Cum Folosim Cookie-urile",
    "We use cookies and similar tracking technologies for the following purposes:": "Folosim cookie-uri și tehnologii similare de urmărire pentru următoarele scopuri:",
    "To enable certain functions of the Site": "Pentru a activa anumite funcții ale Site-ului",
    "To provide analytics and track Site usage": "Pentru a furniza analize și urmări utilizarea Site-ului",
    "To store your preferences and settings": "Pentru a stoca preferințele și setările tale",
    "To personalize your experience": "Pentru a personaliza experiența ta",
    "To deliver relevant advertising (if applicable)": "Pentru a livra publicitate relevantă (dacă este cazul)",
    "To improve Site performance and security": "Pentru a îmbunătăți performanța și securitatea Site-ului",
    "3. Types of Cookies We Use": "3. Tipurile de Cookie-uri Pe Care Le Folosim",
    "3.1 Essential Cookies": "3.1 Cookie-uri Esențiale",
    "These cookies are necessary for the Site to function properly. They enable basic functions like page navigation, access to secure areas, and authentication. The Site cannot function properly without these cookies.": "Aceste cookie-uri sunt necesare pentru ca Site-ul să funcționeze corect. Ele permit funcții de bază precum navigarea pe pagină, accesul la zone securizate și autentificarea. Site-ul nu poate funcționa corect fără aceste cookie-uri.",
    "3.2 Analytics Cookies": "3.2 Cookie-uri de Analiză",
    "These cookies help us understand how visitors interact with our Site by collecting and reporting information anonymously. We use analytics services like Google Analytics to track metrics such as page views, session duration, bounce rates, and traffic sources.": "Aceste cookie-uri ne ajută să înțelegem cum interactionează vizitatorii cu Site-ul nostru prin colectarea și raportarea informațiilor în mod anonim. Folosim servicii de analiză precum Google Analytics pentru a urmări metrici precum vizualizări de pagină, durata sesiunii, rate de respingere și surse de trafic.",
    "3.3 Functional Cookies": "3.3 Cookie-uri Funcționale",
    "These cookies enable enhanced functionality and personalization, such as remembering your language preference, login details, or form inputs. They may be set by us or by third-party providers whose services we use.": "Aceste cookie-uri permit funcționalitate îmbunătățită și personalizare, cum ar fi memorarea preferinței tale de limbă, detalii de autentificare sau intrări în formulare. Pot fi setate de noi sau de furnizori terți ale căror servicii le folosim.",
    "3.4 Marketing/Advertising Cookies": "3.4 Cookie-uri de Marketing/Publicitate",
    "These cookies track your browsing activity to deliver advertisements that are relevant to you and your interests. They may be set by advertising networks with our permission and can track your activity across multiple websites.": "Aceste cookie-uri urmăresc activitatea ta de navigare pentru a livra reclame care sunt relevante pentru tine și interesele tale. Pot fi setate de rețele publicitare cu permisiunea noastră și pot urmări activitatea ta pe mai multe site-uri web.",
    "4. Third-Party Cookies": "4. Cookie-uri Terțe",
    "In addition to our own cookies, we may use third-party cookies from the following services:": "Pe lângă propriile noastre cookie-uri, putem folosi cookie-uri terțe de la următoarele servicii:",
    "Google Analytics": "Google Analytics",
    "For website analytics and performance tracking": "Pentru analize site-uri web și urmărire performanță",
    "Google Tag Manager": "Google Tag Manager",
    "For managing tracking codes and tags": "Pentru gestionarea codurilor și etichetelor de urmărire",
    "Social Media Platforms": "Platforme Social Media",
    "For sharing content and social media integration": "Pentru partajarea conținutului și integrarea social media",
    "These third parties may collect information about your online activities over time and across different websites. We recommend reviewing their privacy policies for more information.": "Aceste terțe părți pot colecta informații despre activitățile tale online de-a lungul timpului și pe diferite site-uri web. Recomandăm să revizuiești politicile lor de confidențialitate pentru mai multe informații.",
    "5. Cookie Duration": "5. Durata Cookie-urilor",
    "Cookies can be either:": "Cookie-urile pot fi fie:",
    "Session Cookies": "Cookie-uri de Sesiune",
    "Temporary cookies that expire when you close your browser": "Cookie-uri temporare care expiră când închizi browserul",
    "Persistent Cookies": "Cookie-uri Persistente",
    "Cookies that remain on your device until they expire or you delete them": "Cookie-uri care rămân pe dispozitivul tău până când expiră sau le ștergi",
    "6. How to Manage Cookies": "6. Cum să Gestionezi Cookie-urile",
    "You can control and manage cookies in several ways:": "Poți controla și gestiona cookie-urile în mai multe moduri:",
    "6.1 Browser Settings": "6.1 Setări Browser",
    "Most web browsers allow you to manage cookies through their settings. You can set your browser to:": "Majoritatea browserelor web îți permit să gestionezi cookie-urile prin setările lor. Poți seta browserul să:",
    "Block all cookies": "Blocheze toate cookie-urile",
    "Accept only first-party cookies": "Accepte doar cookie-uri proprii",
    "Delete cookies when you close your browser": "Șteargă cookie-urile când închizi browserul",
    "Notify you when a cookie is being set": "Te notifice când un cookie este setat",
    "Please note that blocking or deleting cookies may affect your experience and some features of the Site may not function properly.": "Te rugăm să reții că blocarea sau ștergerea cookie-urilor poate afecta experiența ta și unele funcții ale Site-ului pot să nu funcționeze corect.",
    "6.2 Browser-Specific Instructions": "6.2 Instrucțiuni Specifice Browser-ului",
    "Cookie settings": "Setări cookie-uri",
    "6.3 Opt-Out of Analytics": "6.3 Renunțare la Analize",
    "You can opt out of Google Analytics by installing the": "Poți renunța la Google Analytics prin instalarea",
    "Google Analytics Opt-out Browser Add-on": "Add-on-ului Browser de Renunțare la Google Analytics",
    "7. Do Not Track (DNT)": "7. Do Not Track (DNT)",
    "Some browsers include a \"Do Not Track\" (DNT) feature that signals to websites that you do not want to be tracked. We currently do not respond to DNT signals, as there is no industry standard for how to interpret them.": "Unele browsere includ o funcție \"Do Not Track\" (DNT) care semnalează site-urilor web că nu vrei să fii urmărit. În prezent nu răspundem la semnalele DNT, deoarece nu există un standard al industriei pentru cum să le interpretăm.",
    "8. Changes to This Cookie Policy": "8. Modificări ale Acestei Politici Cookie",
    "We may update this Cookie Policy from time to time to reflect changes in our practices or for legal, operational, or regulatory reasons. The updated policy will be posted on this page with a revised \"Last updated\" date.": "Putem actualiza această Politică Cookie periodic pentru a reflecta schimbări în practicile noastre sau din motive legale, operaționale sau de reglementare. Politica actualizată va fi postată pe această pagină cu o dată revizuită \"Ultima actualizare\".",
    "9. Contact Us": "9. Contactează-ne",
    "If you have questions about our use of cookies, please contact us:": "Dacă ai întrebări despre utilizarea cookie-urilor de către noi, te rugăm să ne contactezi:",
    "We Use Cookies": "Folosim Cookie-uri",
    "We use cookies to enhance your browsing experience, serve personalized content, and analyze our traffic. By clicking \"Accept All\", you consent to our use of cookies.": "Folosim cookie-uri pentru a îmbunătăți experiența ta de navigare, pentru a oferi conținut personalizat și pentru a analiza traficul nostru. Apăsând \"Acceptă Toate\", consimți la utilizarea cookie-urilor de către noi.",
    "Learn more": "Află mai multe",
    "Reject All": "Respinge Toate",
    "Customize": "Personalizează",
    "Accept All": "Acceptă Toate",
    "Cookie Preferences": "Preferințe Cookie-uri",
    "Choose which cookies you want to accept. You can change your preferences at any time.": "Alege ce cookie-uri dorești să accepți. Poți schimba preferințele în orice moment.",
    "Essential Cookies": "Cookie-uri Esențiale",
    "Always Active": "Mereu Active",
    "These cookies are necessary for the website to function and cannot be disabled.": "Aceste cookie-uri sunt necesare pentru ca site-ul să funcționeze și nu pot fi dezactivate.",
    "Analytics Cookies": "Cookie-uri de Analiză",
    "Help us understand how visitors interact with our website by collecting anonymous data.": "Ajută-ne să înțelegem cum interacționează vizitatorii cu site-ul nostru prin colectarea de date anonime.",
    "Marketing Cookies": "Cookie-uri de Marketing",
    "Used to deliver personalized advertisements relevant to you and your interests.": "Folosite pentru a livra reclame personalizate relevante pentru tine și interesele tale.",
    "Save Preferences": "Salvează Preferințele",
    "Manage Your Cookie Preferences": "Gestionează Preferințele Cookie-urilor",
    "You can change your cookie preferences at any time by clicking the button below.": "Poți schimba preferințele cookie-urilor în orice moment apăsând butonul de mai jos.",
    "Manage Cookie Preferences": "Gestionează Preferințele Cookie-urilor",
    "Cookie Settings": "Setări Cookie-uri",
    "Terms of Service": "Termeni și Condiții",
    "Last Updated: December 11, 2024": "Ultima Actualizare: 11 Decembrie 2024",
    "Please read these Terms of Service carefully before using our services. By accessing or using our services, you agree to be bound by these terms.": "Vă rugăm să citiți cu atenție acești Termeni și Condiții înainte de a utiliza serviciile noastre. Accesând sau folosind serviciile noastre, sunteți de acord să fiți legat de acești termeni.",
    "1. Acceptance of Terms": "1. Acceptarea Termenilor",
    "By accessing and using the services provided by": "Accesând și utilizând serviciile furnizate de",
    "(\"Company\", \"we\", \"us\", or \"our\"), you accept and agree to be bound by the terms and provisions of this agreement. If you do not agree to these Terms of Service, please do not use our services.": "(\"Compania\", \"noi\" sau \"ale noastre\"), acceptați și sunteți de acord să fiți legat de termenii și dispozițiile acestui acord. Dacă nu sunteți de acord cu acești Termeni și Condiții, vă rugăm să nu utilizați serviciile noastre.",
    "2. Services Description": "2. Descrierea Serviciilor",
    "We provide backend engineering services, payment systems integration, fintech solutions, and related software development services. Our services include but are not limited to:": "Oferim servicii de inginerie backend, integrare sisteme de plată, soluții fintech și servicii conexe de dezvoltare software. Serviciile noastre includ, dar nu se limitează la:",
    "Custom software development": "Dezvoltare software personalizat",
    "Payment systems integration (including Stripe and other payment processors)": "Integrare sisteme de plată (inclusiv Stripe și alți procesatori de plăți)",
    "Backend architecture and infrastructure development": "Dezvoltare arhitectură și infrastructură backend",
    "SaaS platform development": "Dezvoltare platforme SaaS",
    "Technical consulting and support": "Consultanță tehnică și suport",
    "3. User Obligations": "3. Obligațiile Utilizatorului",
    "When using our services, you agree to:": "Când utilizați serviciile noastre, sunteți de acord să:",
    "Provide accurate and complete information": "Furnizați informații precise și complete",
    "Maintain the confidentiality of any account credentials": "Mențineți confidențialitatea oricăror credențiale de cont",
    "Use our services only for lawful purposes": "Utilizați serviciile noastre doar în scopuri legale",
    "Not attempt to interfere with or disrupt our services": "Nu încercați să interferați cu sau să perturbați serviciile noastre",
    "Not use our services to transmit malicious code or conduct unauthorized security testing": "Nu utilizați serviciile noastre pentru a transmite cod malițios sau pentru a efectua teste de securitate neautorizate",
    "Comply with all applicable laws and regulations": "Respectați toate legile și reglementările aplicabile",
    "4. Intellectual Property Rights": "4. Drepturi de Proprietate Intelectuală",
    "Our Intellectual Property": "Proprietatea Noastră Intelectuală",
    "All content, trademarks, logos, and intellectual property displayed on our website and in our services remain the property of": "Tot conținutul, mărcile comerciale, logo-urile și proprietatea intelectuală afișate pe site-ul nostru și în serviciile noastre rămân proprietatea",
    "or its licensors. You may not use, reproduce, or distribute any content without our express written permission.": "sau a licențiatorilor săi. Nu puteți utiliza, reproduce sau distribui niciun conținut fără permisiunea noastră scrisă explicită.",
    "Client Work Product": "Produsul de Lucru al Clientului",
    "Upon full payment for services rendered, the client will own the intellectual property rights to the custom code and deliverables specifically created for their project, subject to the terms of any separate written agreement. We retain ownership of our proprietary tools, frameworks, and pre-existing intellectual property used in the delivery of services.": "La plata integrală pentru serviciile prestate, clientul va deține drepturile de proprietate intelectuală asupra codului personalizat și a livrabilelor create specific pentru proiectul lor, sub rezerva termenilor oricărui acord scris separat. Păstrăm proprietatea asupra instrumentelor noastre proprietare, cadrelor de lucru și proprietății intelectuale preexistente utilizate în furnizarea serviciilor.",
    "5. Payment Terms": "5. Termeni de Plată",
    "Payment for our services will be made according to the terms specified in your service agreement or invoice. We reserve the right to:": "Plata pentru serviciile noastre se va face conform termenilor specificați în acordul de servicii sau în factură. Ne rezervăm dreptul de a:",
    "Require upfront payment or deposits before commencing work": "Solicita plata în avans sau depozite înainte de începerea lucrului",
    "Suspend services for non-payment": "Suspenda serviciile pentru neplată",
    "Charge interest on overdue payments as permitted by law": "Percepe dobânzi la plățile restante conform legii",
    "Engage collection agencies or legal counsel to recover unpaid amounts": "Angaja agenții de colectare sau consilieri juridici pentru recuperarea sumelor neplătite",
    "All fees are non-refundable unless otherwise stated in your service agreement.": "Toate taxele sunt nerambursabile cu excepția cazului în care se specifică altfel în acordul de servicii.",
    "6. Warranties and Disclaimers": "6. Garanții și Declinări de Responsabilitate",
    "We strive to provide high-quality services but make no warranties, express or implied, regarding:": "Ne străduim să furnizăm servicii de înaltă calitate, dar nu oferim garanții, exprese sau implicite, cu privire la:",
    "The uninterrupted or error-free operation of our services": "Funcționarea neîntreruptă sau fără erori a serviciilor noastre",
    "The accuracy or completeness of information provided": "Acuratețea sau exhaustivitatea informațiilor furnizate",
    "The fitness of our services for any particular purpose": "Adecvarea serviciilor noastre pentru orice scop particular",
    "Our services are provided \"as is\" and \"as available\" without warranty of any kind.": "Serviciile noastre sunt furnizate \"ca atare\" și \"după disponibilitate\" fără nicio garanție de niciun fel.",
    "7. Limitation of Liability": "7. Limitarea Răspunderii",
    "To the maximum extent permitted by law,": "În măsura maximă permisă de lege,",
    "shall not be liable for any indirect, incidental, special, consequential, or punitive damages, or any loss of profits or revenues, whether incurred directly or indirectly, or any loss of data, use, goodwill, or other intangible losses resulting from:": "nu va fi responsabil pentru niciun fel de daune indirecte, incidentale, speciale, consecvente sau punitive, sau pentru pierderi de profit sau venituri, indiferent dacă au fost suportate direct sau indirect, sau pentru pierderi de date, utilizare, reputație sau alte pierderi intangibile rezultate din:",
    "Your use or inability to use our services": "Utilizarea sau incapacitatea dumneavoastră de a utiliza serviciile noastre",
    "Any unauthorized access to or use of our servers": "Orice acces sau utilizare neautorizată a serverelor noastre",
    "Any interruption or cessation of transmission to or from our services": "Orice întrerupere sau încetare a transmisiei către sau de la serviciile noastre",
    "Any bugs, viruses, or similar issues transmitted by third parties": "Orice bug-uri, viruși sau probleme similare transmise de terți",
    "Our total liability shall not exceed the amount paid by you for the services in the six months preceding the claim.": "Răspunderea noastră totală nu va depăși suma plătită de dumneavoastră pentru servicii în cele șase luni anterioare reclamației.",
    "8. Indemnification": "8. Indemnizare",
    "You agree to indemnify, defend, and hold harmless": "Sunteți de acord să despăgubiți, să apărați și să exonerați",
    "its officers, directors, employees, agents, and affiliates from any claims, damages, losses, liabilities, and expenses (including legal fees) arising out of:": "directorii, angajații, agenții și afiliații săi de orice revendicări, daune, pierderi, răspunderi și cheltuieli (inclusiv onorariile legale) care decurg din:",
    "Your use of our services": "Utilizarea serviciilor noastre de către dumneavoastră",
    "Your violation of these Terms of Service": "Încălcarea acestor Termeni și Condiții de către dumneavoastră",
    "Your violation of any rights of another party": "Încălcarea oricăror drepturi ale unei alte părți de către dumneavoastră",
    "9. Confidentiality": "9. Confidențialitate",
    "Both parties agree to maintain the confidentiality of any proprietary or confidential information shared during the course of our business relationship. This obligation survives the termination of services.": "Ambele părți sunt de acord să mențină confidențialitatea oricăror informații proprietare sau confidențiale partajate în cursul relației noastre de afaceri. Această obligație supraviețuiește încetării serviciilor.",
    "10. Termination": "10. Încetare",
    "Either party may terminate the service agreement with written notice. Upon termination:": "Oricare dintre părți poate rezilia acordul de servicii cu notificare scrisă. La încetare:",
    "You remain responsible for any outstanding payments": "Rămâneți responsabil pentru orice plăți restante",
    "We will cease providing services": "Vom înceta furnizarea serviciilor",
    "Provisions regarding confidentiality, intellectual property, and liability shall survive": "Dispozițiile privind confidențialitatea, proprietatea intelectuală și răspunderea vor supraviețui",
    "We reserve the right to immediately terminate services if you breach these terms.": "Ne rezervăm dreptul de a înceta imediat serviciile dacă încălcați acești termeni.",
    "11. Modifications to Terms": "11. Modificări ale Termenilor",
    "We reserve the right to modify these Terms of Service at any time. Changes will be effective immediately upon posting to our website. Your continued use of our services after changes are posted constitutes acceptance of the modified terms.": "Ne rezervăm dreptul de a modifica acești Termeni și Condiții în orice moment. Modificările vor intra în vigoare imediat după publicarea pe site-ul nostru. Utilizarea continuă a serviciilor noastre după publicarea modificărilor constituie acceptarea termenilor modificați.",
    "12. Governing Law and Dispute Resolution": "12. Legea Aplicabilă și Soluționarea Disputelor",
    "These Terms of Service shall be governed by and construed in accordance with the laws of the jurisdiction in which": "Acești Termeni și Condiții vor fi guvernați și interpretați în conformitate cu legile jurisdicției în care",
    "operates, without regard to its conflict of law provisions.": "operează, fără a ține cont de dispozițiile sale privind conflictul de legi.",
    "Any disputes arising from these terms or our services shall be resolved through:": "Orice dispute care decurg din acești termeni sau din serviciile noastre vor fi rezolvate prin:",
    "Good faith negotiations between the parties": "Negocieri cu bună-credință între părți",
    "If negotiations fail, binding arbitration or litigation in accordance with local law": "Dacă negocierile eșuează, arbitraj obligatoriu sau litigii în conformitate cu legea locală",
    "13. Severability": "13. Separabilitate",
    "If any provision of these Terms of Service is found to be unenforceable or invalid, that provision will be limited or eliminated to the minimum extent necessary so that these terms otherwise remain in full force and effect.": "Dacă orice prevedere a acestor Termeni și Condiții este considerată neaplicabilă sau nevalidă, acea prevedere va fi limitată sau eliminată în măsura minimă necesară astfel încât acești termeni să rămână altfel în vigoare și efect.",
    "14. Entire Agreement": "14. Acord Integral",
    "These Terms of Service, together with any service agreements or statements of work, constitute the entire agreement between you and": "Acești Termeni și Condiții, împreună cu orice acorduri de servicii sau declarații de lucru, constituie acordul integral între dumneavoastră și",
    "regarding the use of our services and supersede all prior agreements and understandings.": "privind utilizarea serviciilor noastre și înlocuiește toate acordurile și înțelegerile anterioare.",
    "15. Contact Information": "15. Informații de Contact",
    "If you have any questions about these Terms of Service, please contact us at:": "Dacă aveți întrebări despre acești Termeni și Condiții, vă rugăm să ne contactați la:",
    "404 - Page Not Found": "404 - Pagina Nu A Fost Găsită",
    "The page you are looking for could not be found.": "Pagina pe care o căutați nu a fost găsită.",
    "Page Not Found": "Pagină Negăsită",
    "Oops! The page you're looking for seems to have wandered off. It might have been moved, deleted, or perhaps it never existed.": "Oops! Pagina pe care o căutați pare să fi dispărut. S-ar putea să fi fost mutată, ștearsă sau poate nu a existat niciodată.",
    "Back to Home": "Înapoi Acasă",
    "Contact Support": "Contactează Suportul",
    "Or Try These Popular Pages": "Sau Încearcă Aceste Pagini Populare",
    "Too many requests. Please try again later.": "Prea multe solicitări. Vă rugăm să încercați din nou mai târziu.",
    "You may try again in :seconds seconds.": "Puteți încerca din nou în :seconds secunde."
}
