{
    "My Profile": "Profilul Meu",
    "Sign Out": "Deconectare",
    "Profile Information": "Informații Profil",
    "Update your account's profile information and email address.": "Actualizează informațiile profilului și adresa de email.",
    "Avatar": "Avatar",
    "Allowed file types: png, jpg, jpeg. Max 2MB.": "Tipuri de fișiere permise: png, jpg, jpeg. Maxim 2MB.",
    "Remove current avatar": "Elimină avatarul curent",
    "Name": "Nume",
    "Email": "Email",
    "Your email address is unverified.": "Adresa ta de email nu este verificată.",
    "A new verification link has been sent to your email address.": "Un nou link de verificare a fost trimis la adresa ta de email.",
    "Save Changes": "Salvează Modificările",
    "Email Verification": "Verificare Email",
    "Your email address is unverified. Please verify your email to access all features.": "Adresa ta de email nu este verificată. Te rugăm să verifici emailul pentru a accesa toate funcționalitățile.",
    "Resend Verification Email": "Retrimite Email de Verificare",
    "Update Password": "Actualizează Parola",
    "Ensure your account is using a long, random password to stay secure.": "Asigură-te că contul tău folosește o parolă lungă și aleatorie pentru a rămâne în siguranță.",
    "Current Password": "Parola Curentă",
    "New Password": "Parolă Nouă",
    "Confirm Password": "Confirmă Parola",
    "Delete Account": "Șterge Contul",
    "Once your account is deleted, all of its resources and data will be permanently deleted. Before deleting your account, please download any data or information that you wish to retain.": "Odată ce contul tău este șters, toate resursele și datele acestuia vor fi șterse permanent. Înainte de a șterge contul, te rugăm să descarci toate datele sau informațiile pe care dorești să le păstrezi.",
    "Are you sure you want to delete your account? Once your account is deleted, all of its resources and data will be permanently deleted. Please enter your password to confirm you would like to permanently delete your account.": "Ești sigur că vrei să ștergi contul? Odată ce contul este șters, toate resursele și datele acestuia vor fi șterse permanent. Te rugăm să introduci parola pentru a confirma că dorești să ștergi permanent contul.",
    "Password": "Parolă",
    "Enter your password": "Introdu parola",
    "Cancel": "Anulează",
    "Profile updated successfully!": "Profil actualizat cu succes!",
    "Password updated successfully!": "Parolă actualizată cu succes!",
    "You do not have permission to access this resource.": "Nu ai permisiunea de a accesa această resursă.",
    "You do not have the required permission or role to access this resource.": "Nu ai permisiunea sau rolul necesar pentru a accesa această resursă.",
    "Home": "Acasă",
    "About": "Despre Noi",
    "Services": "Servicii",
    "Contact": "Contact",
    "Dashboard": "Panou de Control",
    "Log in": "Autentificare",
    "Building innovative solutions for modern businesses. Your trusted partner in digital transformation.": "Construim soluții inovatoare pentru afaceri moderne. Partenerul tău de încredere în transformarea digitală.",
    "Quick Links": "Link-uri Rapide",
    "All rights reserved.": "Toate drepturile rezervate.",
    "Welcome to": "Bine ați venit la",
    "Transform your business with our innovative solutions. We provide cutting-edge technology and exceptional service to help you succeed.": "Transformă-ți afacerea cu soluțiile noastre inovatoare. Oferim tehnologie de ultimă generație și servicii excepționale pentru a te ajuta să reușești.",
    "Get Started": "Începe Acum",
    "Learn More": "Află Mai Mult",
    "Why Choose Us": "De Ce Să Ne Alegi",
    "We deliver excellence through our core values and expertise": "Oferim excelență prin valorile și expertiza noastră",
    "Fast & Reliable": "Rapid și Fiabil",
    "Lightning-fast performance with 99.9% uptime guarantee. Your business never sleeps, and neither do we.": "Performanță ultrarapidă cu garanție de 99.9% disponibilitate. Afacerea ta nu doarme niciodată, și nici noi.",
    "Secure & Private": "Sigur și Privat",
    "Enterprise-grade security with end-to-end encryption. Your data is protected with military-grade encryption.": "Securitate de nivel enterprise cu criptare end-to-end. Datele tale sunt protejate cu criptare de nivel militar.",
    "Fully Customizable": "Complet Personalizabil",
    "Tailor every aspect to your needs. Our flexible platform adapts to your unique business requirements.": "Personalizează fiecare aspect după nevoile tale. Platforma noastră flexibilă se adaptează cerințelor unice ale afacerii tale.",
    "24/7 Support": "Suport 24/7",
    "Round-the-clock customer support from our expert team. We are here whenever you need us.": "Suport clienți non-stop de la echipa noastră de experți. Suntem aici oricând ai nevoie de noi.",
    "Analytics Dashboard": "Panou de Analiză",
    "Powerful insights with real-time analytics. Make data-driven decisions with our comprehensive dashboard.": "Informații puternice cu analiză în timp real. Ia decizii bazate pe date cu panoul nostru complet.",
    "Team Collaboration": "Colaborare în Echipă",
    "Work together seamlessly with powerful collaboration tools. Keep your team aligned and productive.": "Lucrați împreună fără probleme cu instrumente puternice de colaborare. Mențineți echipa aliniată și productivă.",
    "Ready to get started?": "Gata să începi?",
    "Join thousands of satisfied customers who trust us with their business.": "Alătură-te miilor de clienți mulțumiți care ne încredințează afacerea lor.",
    "Contact Us": "Contactează-ne",
    "View Services": "Vezi Serviciile",
    "About Us": "Despre Noi",
    "Learn more about our mission, vision, and the team behind our success.": "Află mai multe despre misiunea, viziunea și echipa din spatele succesului nostru.",
    "Our Story": "Povestea Noastră",
    "Founded in 2024, we have been at the forefront of digital innovation, helping businesses transform and thrive in the digital age.": "Fondate în 2024, am fost în fruntea inovației digitale, ajutând afacerile să se transforme și să prospere în era digitală.",
    "Our journey began with a simple mission: to provide cutting-edge technology solutions that empower businesses to reach their full potential.": "Călătoria noastră a început cu o misiune simplă: să oferim soluții tehnologice de ultimă generație care împuternicesc afacerile să își atingă întregul potențial.",
    "Today, we serve thousands of clients worldwide, delivering exceptional results and building lasting partnerships.": "Astăzi, servim mii de clienți din întreaga lume, oferind rezultate excepționale și construind parteneriate durabile.",
    "Clients": "Clienți",
    "Team Members": "Membri în Echipă",
    "Satisfaction": "Satisfacție",
    "Our Mission": "Misiunea Noastră",
    "To empower businesses with innovative technology solutions that drive growth, efficiency, and success in the digital era.": "Să împuternicim afacerile cu soluții tehnologice inovatoare care stimulează creșterea, eficiența și succesul în era digitală.",
    "Our Vision": "Viziunea Noastră",
    "To be the leading technology partner for businesses worldwide, recognized for excellence, innovation, and exceptional customer service.": "Să fim partenerul tehnologic de frunte pentru afacerile din întreaga lume, recunoscuți pentru excelență, inovație și servicii excepționale pentru clienți.",
    "Our Values": "Valorile Noastre",
    "The principles that guide everything we do": "Principiile care ghidează tot ceea ce facem",
    "Excellence": "Excelență",
    "We strive for excellence in everything we do": "Ne străduim pentru excelență în tot ceea ce facem",
    "Innovation": "Inovație",
    "Constantly pushing boundaries and exploring new ideas": "Împingem constant limitele și explorăm idei noi",
    "Integrity": "Integritate",
    "Building trust through transparency and honesty": "Construim încredere prin transparență și onestitate",
    "Quality": "Calitate",
    "Delivering superior quality in every project": "Oferim calitate superioară în fiecare proiect",
    "Our Services": "Serviciile Noastre",
    "Comprehensive solutions tailored to your business needs": "Soluții complete adaptate nevoilor afacerii tale",
    "Web Development": "Dezvoltare Web",
    "Custom web applications built with modern technologies. From simple websites to complex enterprise solutions.": "Aplicații web personalizate construite cu tehnologii moderne. De la site-uri simple la soluții enterprise complexe.",
    "Responsive Design": "Design Responsiv",
    "Modern Frameworks": "Framework-uri Moderne",
    "SEO Optimized": "Optimizat SEO",
    "Mobile Development": "Dezvoltare Mobile",
    "Native and cross-platform mobile apps for iOS and Android. Beautiful, fast, and user-friendly applications.": "Aplicații mobile native și cross-platform pentru iOS și Android. Aplicații frumoase, rapide și ușor de utilizat.",
    "iOS & Android": "iOS și Android",
    "Cross-Platform": "Cross-Platform",
    "App Store Deployment": "Implementare în App Store",
    "Cloud Solutions": "Soluții Cloud",
    "Scalable cloud infrastructure and migration services. Maximize performance while minimizing costs.": "Infrastructură cloud scalabilă și servicii de migrare. Maximizează performanța minimizând costurile.",
    "Cloud Migration": "Migrare Cloud",
    "Infrastructure Setup": "Configurare Infrastructură",
    "24/7 Monitoring": "Monitorizare 24/7",
    "Consulting": "Consultanță",
    "Expert guidance to help you make the right technology decisions. Strategic planning and implementation support.": "Îndrumare expertă pentru a te ajuta să iei deciziile tehnologice corecte. Planificare strategică și suport pentru implementare.",
    "Technology Strategy": "Strategie Tehnologică",
    "Digital Transformation": "Transformare Digitală",
    "Process Optimization": "Optimizare Procese",
    "Data Analytics": "Analiză Date",
    "Transform your data into actionable insights. Advanced analytics and business intelligence solutions.": "Transformă datele în informații acționabile. Soluții avansate de analiză și business intelligence.",
    "Data Visualization": "Vizualizare Date",
    "Predictive Analytics": "Analiză Predictivă",
    "Custom Dashboards": "Panouri Personalizate",
    "Security Services": "Servicii de Securitate",
    "Protect your business with enterprise-grade security solutions. Comprehensive security audits and implementation.": "Protejează-ți afacerea cu soluții de securitate de nivel enterprise. Audituri de securitate complete și implementare.",
    "Security Audits": "Audituri de Securitate",
    "Penetration Testing": "Testare de Penetrare",
    "Compliance Management": "Management Conformitate",
    "Need a Custom Solution?": "Ai nevoie de o Soluție Personalizată?",
    "We can tailor our services to meet your specific requirements. Get in touch with us to discuss your project.": "Putem adapta serviciile noastre pentru a îndeplini cerințele tale specifice. Contactează-ne pentru a discuta proiectul tău.",
    "Get in touch with our team. We are here to help you succeed.": "Intră în contact cu echipa noastră. Suntem aici pentru a te ajuta să reușești.",
    "Get in Touch": "Contactează-ne",
    "Have a question or want to work together? Fill out the form and we will get back to you as soon as possible.": "Ai o întrebare sau vrei să colaborăm? Completează formularul și te vom contacta cât mai curând posibil.",
    "Phone": "Telefon",
    "Office": "Birou",
    "Business Hours": "Program",
    "Monday - Friday": "Luni - Vineri",
    "Follow Us": "Urmărește-ne",
    "First Name": "Prenume",
    "Last Name": "Nume",
    "Optional": "Opțional",
    "Subject": "Subiect",
    "Message": "Mesaj",
    "Send Message": "Trimite Mesaj",
    "Trusted by Leading Companies": "De Încredere pentru Companii de Frunte",
    "We are proud to work with these amazing clients": "Suntem mândri să colaborăm cu acești clienți extraordinari",
    "AI-Powered Development": "Dezvoltare Asistată de AI",
    "Leveraging cutting-edge artificial intelligence to accelerate development, optimize code quality, and deliver smarter solutions that evolve with your business needs.": "Folosim inteligența artificială de ultimă generație pentru a accelera dezvoltarea, optimiza calitatea codului și livra soluții inteligente care evoluează odată cu nevoile afacerii tale.",
    "Transform Your Excel Spreadsheets Into Powerful Cloud Solutions": "Transformă Fișierele Excel în Soluții Cloud Puternice",
    "Stop managing your business with outdated spreadsheets. We transform your Excel files into modern, scalable cloud applications with real-time collaboration, automated workflows, and intelligent insights.": "Oprește gestionarea afacerii cu foi de calcul depășite. Transformăm fișierele tale Excel în aplicații cloud moderne, scalabile, cu colaborare în timp real, fluxuri de lucru automatizate și informații inteligente.",
    "Real-Time Collaboration": "Colaborare în Timp Real",
    "Multiple users, instant updates, no version conflicts": "Utilizatori multipli, actualizări instantanee, fără conflicte de versiuni",
    "Automated Workflows": "Fluxuri de Lucru Automatizate",
    "Eliminate manual tasks and reduce human errors": "Elimină sarcinile manuale și reduce erorile umane",
    "Advanced Security": "Securitate Avansată",
    "Role-based access, audit logs, and encrypted data": "Acces bazat pe roluri, jurnale de audit și date criptate",
    "Smart Analytics": "Analiză Inteligentă",
    "AI-powered insights and predictive analytics": "Informații bazate pe AI și analiză predictivă",
    "Transform Your Excel Today": "Transformă-ți Excel-ul Astăzi",
    "Cloud Solution": "Soluție Cloud",
    "Faster": "Mai Rapid",
    "Uptime": "Disponibilitate",
    "Secure": "Securizat",
    "Thank you for your message! We will get back to you soon.": "Mulțumim pentru mesajul tău! Îți vom răspunde în curând.",
    "There was an error sending your message. Please try again later.": "A apărut o eroare la trimiterea mesajului. Te rugăm să încerci din nou mai târziu.",
    "Case Studies": "Studii de Caz",
    "Real projects, real results — see how we've helped companies build scalable payment systems, high-performance platforms, and mission-critical infrastructure": "Proiecte reale, rezultate reale — vezi cum am ajutat companii să construiască sisteme de plăți scalabile, platforme performante și infrastructură critică",
    "Case Study #1: Payments": "Studiu de Caz #1: Plăți",
    "Payment Infrastructure Migration": "Migrarea Infrastructurii de Plăți",
    "ChargeOver → Stripe Billing": "ChargeOver → Stripe Billing",
    "Client": "Client",
    "Financial Platform (USA)": "Platformă Financiară (SUA)",
    "Tech: Stripe Billing, ACH, PHP 8, Laravel, Redis, AWS": "Tehnologii: Stripe Billing, ACH, PHP 8, Laravel, Redis, AWS",
    "Challenge": "Provocare",
    "The company relied on an outdated billing system (ChargeOver), with recurring errors, rigid API capabilities, and low payment recovery rates. They needed a modern payment stack with ACH, subscriptions, proration, retries, and full automation — without downtime.": "Compania se baza pe un sistem de facturare depășit (ChargeOver), cu erori recurente, capabilități API rigide și rate scăzute de recuperare a plăților. Aveau nevoie de un stack modern de plăți cu ACH, abonamente, proration, reîncercări și automatizare completă — fără downtime.",
    "Solution": "Soluție",
    "We architected a complete Stripe migration:": "Am arhitecturat o migrare completă către Stripe:",
    "Modeled products, prices, and subscription lifecycles": "Am modelat produse, prețuri și cicluri de viață ale abonamentelor",
    "Built an adapter-based payment orchestration layer": "Am construit un strat de orchestrare a plăților bazat pe adaptoare",
    "Implemented ACH onboarding & micro-deposit verification": "Am implementat onboarding ACH și verificare prin micro-depozite",
    "Created resilient webhook handlers with retries + idempotency": "Am creat handlere webhook reziliente cu reîncercări + idempotență",
    "Designed payout routes for multi-party financial flows": "Am proiectat rute de plată pentru fluxuri financiare multi-părți",
    "Results": "Rezultate",
    "Downtime": "Downtime",
    "Failed Payments": "Plăți Eșuate",
    "Simplified Reporting": "Raportare Simplificată",
    "Streamlined accounting": "Contabilitate optimizată",
    "Scalable Architecture": "Arhitectură Scalabilă",
    "Ready for new revenue models": "Pregătită pentru noi modele de venit",
    "Zero Downtime": "Zero Downtime",
    "Seamless migration": "Migrare fără întreruperi",
    "Case Study #2: Platform": "Studiu de Caz #2: Platformă",
    "Real-Time Inventory Platform for Retail": "Platformă de Inventar în Timp Real pentru Retail",
    "2,000+ SKU Custom ERP/Cloud Sync": "2,000+ SKU ERP Personalizat/Sincronizare Cloud",
    "Retail / eCommerce": "Retail / eCommerce",
    "Tech: Laravel, Redis, MySQL, Cloud + Local Sync": "Tehnologii: Laravel, Redis, MySQL, Sincronizare Cloud + Local",
    "Retailers needed a system to manage >2000 SKUs across both cloud and local stores, with real-time sync and fail-safe operations.": "Retailerii aveau nevoie de un sistem pentru a gestiona >2000 SKU-uri atât în cloud cât și în magazine locale, cu sincronizare în timp real și operațiuni fail-safe.",
    "We delivered a high-performance inventory engine:": "Am livrat un motor de inventar de înaltă performanță:",
    "Modular architecture": "Arhitectură modulară",
    "Delta-based sync between cloud & POS": "Sincronizare bazată pe delta între cloud & POS",
    "Conflict resolution for concurrent updates": "Rezolvare conflicte pentru actualizări concurente",
    "Near-instant stock adjustments with Redis caching": "Ajustări de stoc aproape instantanee cu caching Redis",
    "Faster Updates": "Actualizări Mai Rapide",
    "Sync Conflicts": "Conflicte de Sincronizare",
    "SKUs Managed": "SKU-uri Gestionate",
    "Cloud Sync": "Sincronizare Cloud",
    "Active": "Activ",
    "Local POS": "POS Local",
    "Synced": "Sincronizat",
    "Multi-Store": "Multi-Magazine",
    "Enabled": "Activat",
    "Case Study #3: Architecture": "Studiu de Caz #3: Arhitectură",
    "Policy Management System for Insurance": "Sistem de Gestionare Polițe pentru Asigurări",
    "Microservices + Event Architecture": "Microservicii + Arhitectură Bazată pe Evenimente",
    "Insurance Platform": "Platformă de Asigurări",
    "Tech: PHP 8, Laravel, Redis, AWS, Microservices": "Tehnologii: PHP 8, Laravel, Redis, AWS, Microservicii",
    "Client needed a scalable, modular system to manage thousands of insurance policies: updates, renewals, events, customer-facing portal.": "Clientul avea nevoie de un sistem scalabil și modular pentru a gestiona mii de polițe de asigurare: actualizări, reînnoiri, evenimente, portal pentru clienți.",
    "We built:": "Am construit:",
    "Microservices architecture for policy management": "Arhitectură de microservicii pentru gestionarea polițelor",
    "Automated workflows for renewals & compliance": "Fluxuri de lucru automate pentru reînnoiri și conformitate",
    "Customer portal for policy updates": "Portal pentru clienți pentru actualizări polițe",
    "Secure document processing + auditing": "Procesare securizată documente + audit",
    "Manual Operations": "Operațiuni Manuale",
    "Visibility": "Vizibilitate",
    "System Architecture": "Arhitectura Sistemului",
    "Microservices": "Microservicii",
    "Modular, scalable architecture": "Arhitectură modulară, scalabilă",
    "Event-Driven": "Bazat pe Evenimente",
    "Real-time policy updates": "Actualizări polițe în timp real",
    "Secure & Audited": "Securizat & Auditat",
    "Full compliance tracking": "Urmărire completă conformitate",
    "Case Study #4: Performance": "Studiu de Caz #4: Performanță",
    "Backend Platform Rewrite & High-Volume Content Processing": "Rescriere Platformă Backend & Procesare Conținut de Mare Volum",
    "High-Performance Parsing, Asynchronous Workflows": "Parsare de Înaltă Performanță, Fluxuri Asincrone",
    "Content Syndication / eCommerce Integrations": "Sindicalizare Conținut / Integrări eCommerce",
    "Tech: PHP, REST APIs, Job Queues, Asynchronous Workers": "Tehnologii: PHP, REST APIs, Cozi de Task-uri, Lucrători Asincron",
    "The platform processed large product data feeds for global retail integrations, but suffered from slow ingestion, blocking operations, and bugs that intermittently disrupted SLAs.": "Platforma procesa feed-uri mari de date de produse pentru integrări retail globale, dar suferea de ingestie lentă, operațiuni blocante și bug-uri care întrerupeau intermitent SLA-urile.",
    "I rebuilt and optimized critical backend systems:": "Am reconstruit și optimizat sisteme backend critice:",
    "Refactored the feed ingestion engine": "Am refactorizat motorul de ingestie feed-uri",
    "Reduced memory usage and improved throughput": "Am redus utilizarea memoriei și am îmbunătățit throughput-ul",
    "Implemented asynchronous job queue architecture": "Am implementat arhitectură de coadă de task-uri asincrone",
    "Added robust retry + recovery logic": "Am adăugat logică robustă de reîncercare + recuperare",
    "Improved error handling and operational visibility": "Am îmbunătățit gestionarea erorilor și vizibilitatea operațională",
    "Delivered additional modules such as feedback and payment integrations": "Am livrat module adiționale precum feedback și integrări de plăți",
    "Faster Feed Ingestion": "Ingestie Feed Mai Rapidă",
    "Platform at Scale": "Platformă la Scară",
    "Stable": "Stabil",
    "Key Improvements": "Îmbunătățiri Cheie",
    "50%+ Faster Ingestion": "50%+ Ingestie Mai Rapidă",
    "Optimized feed processing": "Procesare feed optimizată",
    "Predictable Processing": "Procesare Previzibilă",
    "Async job queue architecture": "Arhitectură coadă task-uri async",
    "Improved SLAs": "SLA-uri Îmbunătățite",
    "Enhanced customer satisfaction": "Satisfacție clienți îmbunătățită",
    "Case Study #5: Architecture": "Studiu de Caz #5: Arhitectură",
    "Lending Platform Modernization & Architecture Upgrade": "Modernizare Platformă de Creditare & Upgrade Arhitectură",
    "Platform Migration, System Architecture, Engineering Processes": "Migrare Platformă, Arhitectură Sistem, Procese de Inginerie",
    "Financial Services": "Servicii Financiare",
    "Tech: .NET, PHP, Redis, CI/CD (Jenkins, Docker, Puppet)": "Tehnologii: .NET, PHP, Redis, CI/CD (Jenkins, Docker, Puppet)",
    "A national-scale lending platform operated a monolithic legacy system with weak development processes, difficult deployments, and a roadmap blocked by technical debt. The platform needed a migration plan to a modern architecture and a fully redefined engineering workflow.": "O platformă de creditare la scară națională opera cu un sistem legacy monolitic cu procese slabe de dezvoltare, deployment-uri dificile și un roadmap blocat de datoria tehnică. Platforma avea nevoie de un plan de migrare către o arhitectură modernă și un workflow de inginerie complet redefinit.",
    "I led the system redesign and platform modernization initiative:": "Am condus inițiativa de redesign sistem și modernizare platformă:",
    "Defined the full architecture for service decomposition": "Am definit arhitectura completă pentru descompunerea serviciilor",
    "Created domain boundaries and data flow diagrams": "Am creat limite de domeniu și diagrame de flux de date",
    "Built transitional services enabling gradual migration": "Am construit servicii tranziționale care permit migrarea graduală",
    "Introduced CI/CD pipelines and standardized release processes": "Am introdus pipeline-uri CI/CD și procese standardizate de release",
    "Established documentation, coding practices, and cross-team workflows": "Am stabilit documentație, practici de programare și workflow-uri inter-echipe",
    "Integrated Redis for caching and performance improvements": "Am integrat Redis pentru caching și îmbunătățiri de performanță",
    "Modern": "Modernă",
    "Architecture": "Arhitectură",
    "Faster": "Mai Rapid",
    "Feature Delivery": "Livrare Funcționalități",
    "Transformation Outcomes": "Rezultate Transformare",
    "Clear Migration Path": "Cale de Migrare Clară",
    "Scalable modern architecture": "Arhitectură modernă scalabilă",
    "Strong Engineering Processes": "Procese Puternice de Inginerie",
    "Company-wide adoption": "Adopție la nivel de companie",
    "Reduced Deployment Failures": "Eșecuri Deployment Reduse",
    "Improved reliability": "Fiabilitate îmbunătățită",
    "Increased Delivery Speed": "Viteză de Livrare Crescută",
    "Better performance & maintainability": "Performanță & mentenabilitate mai bună",
    "Ready to Build Your Platform?": "Gata să Construiești Platforma Ta?",
    "Let's discuss how we can help you build scalable payment systems and high-performance platforms.": "Să discutăm cum te putem ajuta să construiești sisteme de plăți scalabile și platforme performante.",
    "Backend Engineering • Payments & Fintech • Distributed Systems • Cloud Architecture": "Inginerie Backend • Plăți & Fintech • Sisteme Distribuite • Arhitectură Cloud",
    "We Build Scalable Payment Systems": "Construim Sisteme de Plăți Scalabile",
    "& High-Performance Platforms": "& Platforme Performante",
    "designs and delivers mission-critical software for fintech, SaaS, and enterprise platforms. We specialize in Stripe integrations, subscription systems, payment orchestration, API platforms, and event-driven architectures that scale predictably and securely.": "proiectează și livrează software critic pentru platforme fintech, SaaS și enterprise. Ne specializăm în integrări Stripe, sisteme de abonamente, orchestrare plăți, platforme API și arhitecturi bazate pe evenimente care se scalează în mod previzibil și securizat.",
    "Let's Build Your Platform": "Să Construim Platforma Ta",
    "Why": "De Ce",
    "Deep technical expertise in payments, backend systems, and scalable cloud architecture": "Expertiză tehnică profundă în plăți, sisteme backend și arhitectură cloud scalabilă",
    "Deep Payments Expertise": "Expertiză Profundă în Plăți",
    "We architect subscription systems, ACH flows, multi-party payouts, and reliable webhook infrastructures for companies that cannot afford billing mistakes.": "Arhitectăm sisteme de abonamente, fluxuri ACH, plăți multi-părți și infrastructuri webhook fiabile pentru companii care nu își permit greșeli de facturare.",
    "High-Performance Backend": "Backend de Înaltă Performanță",
    "We design backend systems optimized for speed, resilience, and long-term maintainability using PHP 8, Laravel, Redis, MySQL/PostgreSQL, and modern distributed patterns.": "Proiectăm sisteme backend optimizate pentru viteză, reziliență și mentenabilitate pe termen lung folosind PHP 8, Laravel, Redis, MySQL/PostgreSQL și pattern-uri distribuite moderne.",
    "Event-Driven Architecture": "Arhitectură Bazată pe Evenimente",
    "We build event pipelines, queue-based workflows, microservices, and horizontally scalable systems using AWS, Redis, Docker, and modern tooling.": "Construim pipeline-uri de evenimente, workflow-uri bazate pe cozi, microservicii și sisteme scalabile orizontal folosind AWS, Redis, Docker și tooling modern.",
    "Security & Compliance": "Securitate & Conformitate",
    "From PCI-aligned data handling to secure onboarding and identity flows, we design software that meets serious industry standards.": "De la gestionarea datelor aliniate PCI la onboarding securizat și fluxuri de identitate, proiectăm software care îndeplinește standarde serioase ale industriei.",
    "What We Deliver": "Ce Livrăm",
    "Enterprise-grade systems built for scale, reliability, and long-term success": "Sisteme de nivel enterprise construite pentru scalabilitate, fiabilitate și succes pe termen lung",
    "Payment Orchestration Layers": "Straturi de Orchestrare Plăți",
    "Stripe Billing / Connect / ACH": "Stripe Billing / Connect / ACH",
    "Fintech-Grade Backend Systems": "Sisteme Backend de Nivel Fintech",
    "Scalable API Platforms": "Platforme API Scalabile",
    "Event-Driven Processing": "Procesare Bazată pe Evenimente",
    "Subscription & Invoicing Engines": "Motoare de Abonamente & Facturare",
    "Cloud Infrastructure & Tuning": "Infrastructură Cloud & Optimizare",
    "Legacy Payment Migrations": "Migrări de Sisteme de Plăți Legacy",
    "Distributed Queue Workflows": "Workflow-uri cu Cozi Distribuite",
    "View All Services": "Vezi Toate Serviciile",
    "Featured Work": "Lucrări Notabile",
    "Payments": "Plăți",
    "Migration from ChargeOver to Stripe Billing": "Migrare de la ChargeOver la Stripe Billing",
    "Financial Platform, USA": "Platformă Financiară, SUA",
    "Complete payment infrastructure migration with zero downtime. Implemented ACH onboarding, webhook orchestration, and resilient retry logic for a financial platform serving thousands of customers.": "Migrare completă a infrastructurii de plăți cu zero downtime. Am implementat onboarding ACH, orchestrare webhook și logică de reîncercare rezillientă pentru o platformă financiară care deservește mii de clienți.",
    "Platform": "Platformă",
    "Real-Time Inventory Platform for Retail": "Platformă de Inventar în Timp Real pentru Retail",
    "Custom ERP/Cloud Sync": "ERP Personalizat/Sincronizare Cloud",
    "Built a high-performance inventory engine managing 2,000+ SKUs with real-time cloud and local sync, delta-based updates, and conflict resolution for concurrent operations.": "Am construit un motor de inventar de înaltă performanță care gestionează 2,000+ SKU-uri cu sincronizare în timp real cloud și locală, actualizări bazate pe delta și rezolvare conflicte pentru operațiuni concurente.",
    "Policy Management System for Insurance": "Sistem de Gestionare Polițe pentru Asigurări",
    "Designed scalable microservices architecture for insurance platform with automated workflows, policy lifecycle management, and secure document processing with full audit trails.": "Am proiectat arhitectură de microservicii scalabilă pentru platformă de asigurări cu workflow-uri automate, gestionare ciclu de viață polițe și procesare securizată documente cu piste de audit complete.",
    "See All Case Studies": "Vezi Toate Studiile de Caz",
    "Expert engineering services for payment systems, backend platforms, and scalable cloud architecture": "Servicii de inginerie expert pentru sisteme de plăți, platforme backend și arhitectură cloud scalabilă",
    "Payments & Fintech Engineering": "Inginerie Plăți & Fintech",
    "We architect and implement complex financial workflows:": "Arhitectăm și implementăm workflow-uri financiare complexe:",
    "Stripe Billing, Direct & Connect": "Stripe Billing, Direct & Connect",
    "ACH debit/credit flows": "Fluxuri ACH debit/credit",
    "Subscription lifecycles": "Cicluri de viață abonamente",
    "Split payments / marketplaces": "Plăți împărțite / marketplace-uri",
    "Webhook orchestration (idempotency, retries)": "Orchestrare webhook (idempotență, reîncercări)",
    "PCI-aligned data handling": "Gestionare date aliniată PCI",
    "Migration from legacy billing providers": "Migrare de la furnizori legacy de facturare",
    "Ideal for: SaaS, fintech, marketplaces, financial apps": "Ideal pentru: SaaS, fintech, marketplace-uri, aplicații financiare",
    "Backend & Platform Engineering": "Inginerie Backend & Platformă",
    "We design scalable backend systems using modern engineering practices:": "Proiectăm sisteme backend scalabile folosind practici moderne de inginerie:",
    "PHP 8 / Laravel / Symfony": "PHP 8 / Laravel / Symfony",
    "Redis queues & event-driven workflows": "Cozi Redis & workflow-uri bazate pe evenimente",
    "Microservices & modular architecture": "Microservicii & arhitectură modulară",
    "Optimized SQL schema design": "Design schemă SQL optimizat",
    "High-performance APIs": "API-uri de înaltă performanță",
    "Large data processing & exports": "Procesare date la scară largă & exporturi",
    "Ideal for: platforms under heavy load or needing modernization": "Ideal pentru: platforme sub sarcină mare sau care necesită modernizare",
    "Cloud & Infrastructure": "Cloud & Infrastructură",
    "We build predictable, cost-effective environments:": "Construim medii previzibile și cost-eficiente:",
    "AWS ECS/EC2/RDS/S3": "AWS ECS/EC2/RDS/S3",
    "Dockerized pipelines": "Pipeline-uri Docker",
    "CI/CD automation": "Automatizare CI/CD",
    "Observability: Datadog, Sentry, CloudWatch": "Observabilitate: Datadog, Sentry, CloudWatch",
    "High-availability setups": "Configurări high-availability",
    "Infrastructure hardening": "Întărire infrastructură",
    "Ideal for: scaling platforms, reducing downtime, reliability": "Ideal pentru: scalarea platformelor, reducerea downtime-ului, fiabilitate",
    "Custom Software Development": "Dezvoltare Software Personalizat",
    "From concept to launch:": "De la concept la lansare:",
    "Custom admin dashboards": "Panouri admin personalizate",
    "Customer onboarding flows": "Fluxuri de onboarding clienți",
    "Multi-tenant applications": "Aplicații multi-tenant",
    "API integrations (banking, CRM, ERP)": "Integrări API (banking, CRM, ERP)",
    "Workflow automation": "Automatizare workflow",
    "Ideal for: long-term, maintainable systems": "Ideal pentru: sisteme pe termen lung, mentenabile",
    "A senior engineering-driven software studio focused on high-performance backend systems, fintech integrations, and scalable cloud architectures.": "Un studio software condus de ingineri seniori, focusat pe sisteme backend de înaltă performanță, integrări fintech și arhitecturi cloud scalabile.",
    "Founder & Senior Engineer": "Fondator & Inginer Senior",
    "15+ years experience in:": "15+ ani experiență în:",
    "Financial services": "Servicii financiare",
    "SaaS platforms": "Platforme SaaS",
    "Enterprise systems": "Sisteme enterprise",
    "We are a senior engineering-driven software studio focused on high-performance backend systems, fintech integrations, and scalable cloud architectures.": "Suntem un studio software condus de ingineri seniori, focusat pe sisteme backend de înaltă performanță, integrări fintech și arhitecturi cloud scalabile.",
    "Founded by Razvan, a Senior Backend/Platform Engineer with 15+ years of experience in financial services, SaaS platforms, and enterprise systems.": "Fondat de Razvan, un Inginer Senior Backend/Platformă cu 15+ ani de experiență în servicii financiare, platforme SaaS și sisteme enterprise.",
    "Our Philosophy": "Filozofia Noastră",
    "Build systems that don't break.": "Construim sisteme care nu se strică.",
    "Design architectures that scale.": "Proiectăm arhitecturi care se scalează.",
    "Deliver software that lasts.": "Livrăm software care durează.",
    "Expertise Highlights": "Puncte Forte de Expertiză",
    "Payment orchestration": "Orchestrare plăți",
    "Stripe, ACH, Connect": "Stripe, ACH, Connect",
    "Backend architecture": "Arhitectură backend",
    "Distributed systems": "Sisteme distribuite",
    "API platforms": "Platforme API",
    "Finance & insurance": "Finanțe & asigurări",
    "Cloud-native solutions": "Soluții cloud-native",
    "AWS": "AWS",
    "High-availability platforms": "Platforme high-availability",
    "Platform engineering": "Inginerie platformă",
    "Who We Work With": "Cu Cine Lucrăm",
    "SaaS Companies": "Companii SaaS",
    "Fintech & Insurtech": "Fintech & Insurtech",
    "Enterprise Platforms": "Platforme Enterprise",
    "Growth-Stage Startups": "Startup-uri în Creștere",
    "We partner with forward-thinking companies building the future": "Colaborăm cu companii vizionare care construiesc viitorul",
    "Subscription platforms needing billing infrastructure, payment orchestration, and scalable backend systems": "Platforme de abonamente care necesită infrastructură de facturare, orchestrare plăți și sisteme backend scalabile",
    "Financial services requiring PCI compliance, ACH flows, secure processing, and regulatory standards": "Servicii financiare care necesită conformitate PCI, fluxuri ACH, procesare securizată și standarde de reglementare",
    "Large-scale systems handling high volume, complex integrations, and mission-critical operations": "Sisteme la scară largă care gestionează volume mari, integrări complexe și operațiuni critice",
    "Fast-growing companies needing to scale infrastructure, modernize legacy code, and build for the next phase": "Companii în creștere rapidă care trebuie să scaleze infrastructura, să modernizeze codul legacy și să construiască pentru faza următoare",
    "Digital transformations": "Transformări digitale",
    "Legacy modernization": "Modernizare legacy"
}
